{
  "articles": [
    {
      "title": "2013-'14 Honda Accord, 2013 Acura RDX and ILX Get Siri Eyes Free",
      "tags": ["news", "2013 Acura RDX", "Honda Accord", "2013 Acura ILX"],
      "niceNamedTags": [
        "2013-acura-rdx",
        "honda-accord",
        "news",
        "2013-acura-ilx"
      ],
      "description": "The 2013-'14 Honda Accord and 2013 Acura RDX and ILX now offer Apple's Siri Eyes Free mode as a dealer-installed accessory.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/car-news/2013-14-honda-accord-2013-acura-rdx-and-ilx-get-siri-eyes-free.html"
      },
      "authors": [
        {
          "name": "Anita Lienert"
        }
      ],
      "body": "<strong>Just the Facts:\n<ul class=\"list-style\">\n<li>The 2013-'14 Honda Accord and 2013 Acura RDX and ILX now offer Apple's Siri Eyes Free mode as a dealer-installed accessory.</li>\n<li>Drivers can direct Siri to perform a number of tasks, including sending text messages and e-mails.</li>\n<li>Pricing for the accessory has not been posted on the Honda vehicle configurator.</li> \n</ul>\n</strong>\n<br/> \n<p><strong>TORRANCE, California</strong> &mdash; The 2013-'14 <a href=\"/honda/accord/\">Honda Accord</a> and <a href=\"/acura/rdx/2013/?sub=suv\">2013 Acura RDX</a> and <a href=\"/acura/ilx/\">ILX</a> now offer Apple's Siri Eyes Free mode as a dealer-installed accessory, Honda announced on Tuesday.</p>\n\n<p>Drivers can direct Siri to perform a number of tasks, including sending text messages and e-mails. Siri can also set up calendar entries, check the weather and provide turn-by-turn voice navigation when the audio system is set to Bluetooth or iPod mode.</p>\n\n<p>Pricing for the accessory has not been posted on the Honda vehicle configurator.</p>\n\n<p>Honda said additional Siri Eyes Free functionality on Honda vehicles will be revealed on December 3. </p>\n\n<p><strong><em>Edmunds</em> says:</strong> Siri Eyes Free rolls out on a limited number of Honda vehicles at this point, but it's likely more will follow.</p>\n"
    },
    {
      "title": "2013 Acura ILX Hybrid Track Test",
      "tags": ["features", "Acura ILX", "hybrid", "2013 Acura ILX"],
      "niceNamedTags": ["acura-ilx", "2013-acura-ilx", "features", "hybrid"],
      "description": "Edmunds.com Track Tests the 2013 Acura ILX Hybrid.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/car-reviews/track-tests/2013-acura-ilx-hybrid-track-test.html"
      },
      "authors": [
        {
          "name": "<a rel=\"author\" href=\"/about/authors/mike-magrath.html\">Mike Magrath</a>, Features Editor"
        }
      ],
      "body": "<p>Inside Line <em>tests hundreds of vehicles a year. Cars, trucks, SUVs, we run them all, and the numbers always tell a story. With that in mind we present \"IL Track Tested,\" a quick rundown of all the data we collect at the track, along with comments direct from the test drivers. Enjoy</em>.</p>\n\n<p>Acura's newest model, the ILX, is aimed squarely at attracting younger buyers to the Acura brand. Acura's already attacked the drivers of the segment with the <a href=\"/acura/ilx/2013/\">ILX 2.4</a> and its straight-from-a-Civic-Si powertrain, and now it's aiming at the green set with the 2013 Acura ILX Hybrid.</p>\n\n<p>The Hybrid swaps out the fan-favorite 2.4-liter inline-4 and six-speed manual transmission for a 1.5-liter four-pot backed by an electric motor and a CVT (continuously variable transmission). This results in a 90-hp drop, but a significant improvement in fuel economy. The 2013 Acura ILX Hybrid returns 39 city/38 highway mpg and a combined EPA rating of 38 mpg.</p>\n\n<p>But is it any good to drive? We took it to the track to find out.</p>\n\n<p><strong>Vehicle:</strong> <a href=\"/acura/ilx/2013/features-specs.html?sub=hybrid&style=200419090\">2013 Acura ILX Hybrid with Technology Package</a><br />  \nOdometer: 2,876<br />\nDate: 7/3/2012<br />\nDriver: Chris Walton<br />\nPrice: $35,295 (price as tested)</p>\n\n<p><strong>Specifications:</strong><br />\nDrive Type: Front engine, front-wheel drive<br />\nTransmission Type: CVT<br />\nEngine Type: Naturally aspirated, port-injected inline-4<br />\nDisplacement (cc/cu-in): 1,497/91.4<br />\nRedline (rpm): 6,000<br />\nHorsepower (hp @ rpm): 111 @ 5,500<br />\nTorque (lb-ft @ rpm): 127 @ 1,000<br />\nBrake Type (front): 10.3-inch ventilated discs with single-piston sliding calipers<br />\nBrake Type (rear): 10.2-inch solid discs with single-piston sliding calipers <br />\nSuspension Type(front): Independent MacPherson struts, coil springs, twin-tube dampers, stabilizer bar<br />\nSuspension Type (rear): Independent multilink, coil springs, twin-tube dampers, stabilizer bar<br />\nTire Size (front): P205/55R16 (89H) <br />\nTire Size (rear): P205/55R16 (89H) <br />\nTire Brand: Continental<br />\nTire Model: ContiProContact<br />\nTire Type: All-season<br />\nAs tested Curb Weight (lb): 2,960<br />\n\n<p><strong>Test Results:</strong><br />\nAcceleration<br />\n0-30 (sec): 3.8 (3.9 w/ TC on) <br />\n0-45 (sec): 6.5 (6.6 w/ TC on) <br />\n0-60 (sec): 10.4 (10.5 w/ TC on) <br />\n0-60 with 1-ft Rollout (sec): 10.0 (10.1 w/ TC on) <br />\n0-75 (sec): 16.2 (16.2 w/ TC on) <br />\n1/4-Mile (sec @ mph): 17.6 @ 77.9 (17.7 @ 78.2 w/ TC on) <br /><br />\nBraking <br />\n30-0 (ft): 31<br />\n60-0 (ft): 129<br /><br />\nHandling<br />\nSlalom (mph): 63.6 (61.0 w/ESC ON) <br />\nSkid Pad Lateral Acceleration (g): 0.81 (0.77 w/TC on) <br />\nDb @ Idle: 38.0 (engine off) <br />\nDb @ Full Throttle: 74.1<br />\nDb @ 70 mph Cruise: 69.1<br />\n\nRPM @ 70: 2,250</p>\n \n<p><strong>Comments:</strong><br />\n<strong>Acceleration:</strong> The ILX benefits only slightly from Trac Off and generous pedal overlap to keep the engine running at launch. Drive is the quickest/fastest mode &mdash; S and Manual shift modes are slower because they insert artificial gearchanges into the CVT's otherwise near-redline quarter-mile passes.</p>\n\n<p><strong>Braking:</strong> Normal jump-in with normal driving disappears with a \"panic\" stop where the car feels as if it didn't begin braking in earnest until 45-0 (just like the non-hybrid ILX). First stop was the shortest and the pedal went slightly softer by the fourth stop, where it tracked straight, but distance grew by 4-5 feet.</p>\n\n<p><strong>Handling:</strong><br /> \n<em>Skid pad:</em> With ESC Off, the ILX feels well balanced and begins a mild understeer condition that only requires throttle steering &mdash; I never moved my hands at all. Steering is pretty isolated with linear buildup, but doesn't feel like numb EPS per se. With ESC On it begins to allow the same amount of understeer, but closes throttle shy of howling tires.</p>\n\n<p><em>Slalom:</em> Slow-ish steering response (a little numb, too), moderate yaw reaction, but it feels stable and predictable nonetheless. With ESC Off, the car is neutral and wants to be chucked past each cone, but the tires won't cash that check and only allow predictable breakaway at a fairly low threshold. ESC On snubbed understeer with fairly heavy-handed (and loud) individual brake application. Effective but obviously conservative settings.</p>\n\n<p><em>The manufacturer provided Edmunds this vehicle for the purposes of evaluation.</em></p>"
    },
    {
      "title": "2013 Acura ILX Review",
      "tags": ["Acura ILX", "Acura", "editor reviews", "2013 Acura ILX"],
      "niceNamedTags": [
        "acura-ilx",
        "2013-acura-ilx",
        "acura",
        "editor-reviews"
      ],
      "description": "Edmunds.com reviews the 2013 Acura ILX, providing authoritative buying advice, pricing, available options, photos, specs and safety information.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/acura/ilx/2013/index.html"
      },
      "authors": [],
      "body": "\n\n<p>After a decade of moving upmarket and farther away from the entry-level buyer, Acura's back with a new-generation compact model, the 2013 ILX. Smaller and less expensive than the TSX, the ILX sedan is aimed at shoppers who want something a bit nicer and sportier than the typical mainstream sedan but aren't willing to step up to the higher expense of an established luxury car. Overall, the ILX is fairly successful in its mission. Nevertheless, you'll also want to be aware of the limitations of this strategy.</p>\n<p>The 2013 Acura ILX is based on the <a href=\"/honda/civic/\">Honda Civic</a>, but it's slightly longer and wider, and has unique styling that sets it pretty far apart from its <a href=\"/honda/\">Honda</a> relative. Most importantly, there are significant engineering and interior enhancements. Dismissing the ILX as just a Civic wearing <a href=\"/acura/\">Acura</a> badges would be unfair.</p>\n<p>There's just a single sedan body style, but Acura's making up for the lack of coupe/hatchback options by offering three distinct powertrain options for the new ILX. The base ILX comes with a modestly powered but economical 2.0-liter four-cylinder engine and a five-speed automatic transmission. Markedly more performance comes from the ILX 2.4 and its larger, more-powerful 2.4-liter four-cylinder. Unfortunately this model comes only with a six-speed manual transmission. The third ILX model is the frugal Hybrid, which is the first hybrid-electric vehicle from Acura.</p>\n<p>With a comfortable ride, comparatively spacious interior and decent level of standard equipment, the base ILX is a new and interesting option for buyers looking for an affordable entry point into the premium Acura brand. The ILX 2.4 is compelling as a low-key premium sport sedan, but it is expensive in relation to its absolute performance, and the lack of an automatic transmission limits its appeal. The ILX Hybrid delivers good -- but not outstanding -- fuel economy and also is relatively expensive.</p>\n<p>The 2013 Acura ILX is one of but a few choices for a truly entry-level car from a luxury brand. The <a href=\"/buick/verano/2013/\">Buick Verano</a> is one such model. It may not offer a hybrid version, but it's less expensive to start and offers a strong 250-horsepower engine upgrade as well as a nicer interior. There are also the <a href=\"/audi/a3/2013/\">Audi A3</a> and <a href=\"/lexus/ct200h/2013/\">Lexus CT 200h</a>, two premium models worth cross-shopping with the ILX, as they offer hatchback utility and fuel economy similar to that of the ILX Hybrid.</p>\n<p>One other aspect to consider is the ILX's price once you've loaded it up with options. For the same money, you could also get a loaded version of a popular midsize sedan such as a Ford Fusion, Kia Optima or Nissan Altima. You could also save some money and consider loaded versions of the Dodge Dart or Ford Focus. Most of these cars will offer the same number of convenience and luxury features as the ILX. But for somebody desiring a relatively affordable small sedan that's good on gas and gives off a premium vibe, the ILX is a smart choice.</p>"
    },
    {
      "title": "Track Tested: 2013 Acura ILX",
      "tags": ["track tested", "sedans", "2013 Acura ILX"],
      "niceNamedTags": ["track-tested", "2013-acura-ilx", "sedans"],
      "description": "We test hundreds of vehicles a year. Cars, trucks, SUVs, we run them all, and the numbers always tell a story. With that in mind we present Track Tested a quick rundown of all the data we...",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/car-reviews/track-tests/track-tested-2013-acura-ilx.html"
      },
      "authors": [
        {
          "name": "Mike Magrath"
        }
      ],
      "body": "<p><img alt=\"2013 Acura ILX\" height=\"400\" src=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=85&image=/acura/ilx/2013/ot/2013_acura_ilx_actf34_ot_509122_600.jpg\" width=\"600\" /></p>\n\n\n  <p>In our First Drive of the 2013 Acura ILX we wrote, \"The 2013 Acura ILX is the smallest sedan in Acura's lineup since the Integra, but it's not a spiritual successor to that car.\" So it's not, but the ILX 2.4L model is a kissing cousin to the 2012 Honda Civic, complete with the <a href=\"//blogs.insideline.com/straightline/2011/05/il-track-tested-2012-honda-civic-si-coupe.html\">Civic Si's</a> 201-horsepower 2.4-liter inline-4 and slick six-speed manual transmission.</p>\n  <p>Acura may be excited about the prospect of having a high-volume car that returns good fuel economy while still offering Acura levels of luxury, but we're excited to see what the new ILX does on our track when equipped with the hottest of its three engines. </p>\n  <p>Follow the jump for the results of the world's first test of the 2013 Acura ILX. </p>\n\n              <p><strong>Vehicle: 2013 Acura ILX 2.4L<br /></strong></p>\n  <p>Odometer: <br />Date: 5/8/2012<br />Driver: Chris Walton<br />Price: $30,095 (base price)<br />\n  </p>\n  <p><strong>Specifications:</strong><br />Drive Type: Front engine, front-wheel drive<br />Transmission Type: Six-speed manual<br />Engine Type: Naturally aspirated, port-injected inline-4<br />Displacement (cc/cu-in): 2,354/144<br />Redline (rpm): 7,000 (fuel cutoff at 7,200)<br />Horsepower (hp @ rpm): 201 @ 7,000<br />Torque (lb-ft @ rpm): 170 @ 4,400<br />Brake Type (front): 11.8-inch ventilated discs with single-piston sliding calipers<br />Brake Type (rear): 10.2-inch solid discs with single-piston sliding calipers <br />Suspension Type(front): Independent MacPherson struts, coil springs, twin-tube dampers, stabilizer bar<br />Suspension Type (rear): Independent multilink, coil springs, twin-tube dampers, stabilizer bar<br />Tire Size (front): P215/45R17 (87V)<br />Tire Size (rear): P21545R17 (87V)<br />Tire Brand: Michelin<br />Tire Model: Pilot HX MXM4<br />Tire Type:  All-season<br />As tested Curb Weight (lb): 2,954<br />\n  </p>\n  <p><strong>Test Results:</strong></p>\n  <p>Acceleration<br />0-30 (sec): 2.7 (2.8 w/ TC on)<br />0-45 (sec): 4.6 (4.9 w/ TC on)<br />0-60 (sec): 7.1 (7.7 w/ TC on)<br />0-60 with 1-ft Rollout (sec): 6.8 (7.4 w/ TC on)<br />0-75 (sec): 10.5 (11.2 w/ TC on)<br />1/4-Mile (sec @ mph): 15.3 @ 91.6 (15.7 @ 88.5 w/ TC on)</p>\n  <p>Braking <br />30-0 (ft): 30<br />60-0 (ft): 130</p>\n  <p>Handling<br />Slalom (mph): 65.5 (63.1 w/TC off)<br />Skid Pad Lateral acceleration (g): 0.83 (0.82 w/TC on) </p>\n  <p>Db @ Idle: 42.5<br />Db @ Full Throttle: 77.5 <br />Db @ 70 mph Cruise: 65.6<br />\n  </p>\n\n  <p><strong>Comments</strong>:</p>\n  <p><strong>Acceleration: </strong>There's a sweet spot of wheelspin the ILX enjoys that is good for more than a half second in acceleration. Engine sounds sweet and there's no audible/visceral cam phase. Shifter is excellent, accurate, short and well-oiled. Clutch uptake is intuitive and smooth throughout pedal travel.<br />\n  </p>\n  <p><strong>Braking:</strong> Very little initial bite and meaningful slowing begins from +/-40 mph to zero. Pedal is firm, but there's no power here. Linear fade in distance, yet pedal feel remained constant.  </p>\n  <p><strong>Handling:</strong><br />\n<em>Skid pad:</em> With ESC off, the ILX goes into gentle yet stubborn understeer. Steering feedback changes very little with waning grip, and effort remains light-ish. With ESC on, it chopped throttle lightly below the car's true limit (prior to tire howl).</p>\n  <p><em>Slalom:</em> I really like the steering: Friction free, just enough weight and good yaw reaction. Turns in predictably, tracks well, but the suspension is just a little reluctant in transitions and I end up \"late\" at the next cone(s) if I enter too hot. Best run is slow-in-fast-out with a small slide at exit and unweighted tire spinning free. </p>\n  <p>\n    <iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"410\" src=\"https://www.youtube.com/embed/ABn4KCXnzxQ\" width=\"615\">\n    </iframe>\n  </p>"
    },
    {
      "title": "2013 Acura ILX First Drive",
      "tags": [
        "compact sedans",
        "road tests",
        "compact vehicles",
        "Acura ILX",
        "first drives",
        "Acura",
        "sedans",
        "2013 Acura ILX"
      ],
      "niceNamedTags": [
        "compact-sedans",
        "acura-ilx",
        "2013-acura-ilx",
        "sedans",
        "first-drives",
        "compact-vehicles",
        "acura",
        "road-tests"
      ],
      "description": "An Edmunds.com Road Test Review of the 2013 Acura ILX featuring reviews of its performance, comfort, function, design and build quality.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/acura/ilx/2013/road-test.html"
      },
      "authors": [
        {
          "name": "<a rel=\"author\" href=\"/about/authors/erin-riches.html\">Erin Riches</a>, Senior Editor"
        }
      ],
      "body": "\n<p>The 2013 Acura ILX is the smallest sedan in Acura's lineup since the Integra, but it's not a spiritual successor to that car.</p>\n\n<p>Although the ILX is efficient and lightweight like the <a href=\"/car-reviews/features/1998-acura-integra-type-r-vs-2010-honda-civic-si.html\">Acura Integra</a>, the ILX is a more polished sedan for grown-ups. It has a well-damped ride, an upscale interior and plenty of electronics to placate smartphone users. It's priced sanely, too, with a base MSRP of $26,795.</p>\n\n<p>It's the kind of small car you enjoy driving to work more so than wringing it out on a back road. And while that's not exactly what old-school Honda guys want to hear, the ILX marks a return to the less-is-more philosophy that defined Acura in its early years.</p>\n\n<p><strong>It's a Civic, Right?</strong><br />\nMuch like the dear old Integra, the 2013 Acura ILX shares its wheelbase (105.1 inches) and platform architecture with the current-generation <a href=\"/hyundai/elantra/2011/comparison-test.html\">Honda Civic sedan</a>. But it isn't a straight-up badge-and-paint job.</p>\n\n<p>Acura engineers lengthened the car's nose, fitted an aluminum hood and set the windshield farther back to lessen the pronounced cab-forward feel of the Civic, while adding nearly 2 inches to overall length (179.1 inches). In addition, the ILX is 1.6 inches wider (70.6 inches), and its roof line is 1 inch lower, reducing overall height to 55.6 inches. The result is a sedan that wears the current Acura beak more naturally than any other car in the lineup.</p>\n\n<p>Inside, the Civic's controversial, digital-over-analog gauge pack has been banished in favor of more traditional instrumentation. We immediately notice the upgraded materials, all of which look and feel good, including the metallic trim. Quality isn't quite at TSX levels, but it's easily on par with the Honda Accord. Of course, the ILX comes with more amenities than the Civic, like standard dual-zone climate control, Bluetooth connectivity, a rearview camera and a leather-wrapped steering wheel, all of which push the curb weight up to 2,900 pounds on the lightest version. That's about 100 pounds more than a 2012 Civic EX-L Navi, or if you're curious, an automatic-equipped 2000 Integra GS sedan.</p>\n\n<p>The 2013 Acura ILX is close in size to the <a href=\"/buick/verano/2012/road-test/\">Buick Verano</a> and <a href=\"/volkswagen/jetta/2011/road-test/\">Volkswagen Jetta</a>, but company officials don't consider either of those cars key competitors. Instead, they have their eyes on the <a href=\"/audi/a3/2006/road-test/\">Audi A3</a>, <a href=\"/volvo/s40/\">Volvo S40</a> (well, whatever latent demand it left behind when Volvo discontinued it) and <a href=\"/lexus/ct-200h/2011/road-test/\">Lexus CT 200h</a>.</p>\n\n<p><strong>Pick Your Drivetrain</strong><br />\nHonestly, it's hard to pinpoint the 2013 ILX's competition, because Acura is offering three very different drivetrains on this car. The company expects 75 percent of customers (and it's hoped there will be 35,000 of them annually) to go for the ILX 2.0L model, and that's the one we're driving on this sunny morning in Scottsdale.</p>\n\n<p>It features a single-overhead-cam, 2.0-liter inline four-cylinder engine that's essentially a longer-stroke version (81mm bore diameter, 97mm stroke) of the 1.8-liter engine in the Civic (81mm by 87mm). Compression remains 10.6:1, and the engine uses variable intake valves to improve power and efficiency. The 2.0-liter is rated at 150 horsepower at 6,500 rpm and 140 pound-feet of torque at 4,300 rpm &mdash; up from 140 hp and 128 lb-ft at the same thresholds in the Civic. In a nod to reality, Acura is only offering this engine with a five-speed automatic transmission driving its front wheels. As in the TSX, you get a manual mode and paddle shifters.</p>\n\n<p>While we're busy talking, our co-driver hits the highway and the ILX 2.0L gets up to freeway speed easily enough. It's light on low-end grunt, but it feels stronger than the Civic EX we tested, and we expect it to beat that car's 9.2-second 0-60-mph time when we eventually test it. Acura estimates the ILX's EPA fuel economy ratings at 24 city/35 highway/28 combined mpg versus 28/39/32 for an automatic-equipped Civic.</p>\n\n<p>As this is a Honda four-cylinder, it feels most potent up high and revs freely to its 6,700-rpm redline. Upshifts are smooth, and downshifts come when we need them in \"D,\" though <a href=\"/mazda/mazda3/2012/road-test/\">Mazda's new six-speed automatic</a> provides quicker gearchanges (whether you want to acknowledge Mazda as a competitor or not). Overall, this five-speed auto gets the job done, and we even detect some attempt to match revs when driving with more gusto.</p>\n\n<p><strong>What Are My Other Choices? </strong><br />\nNext up is the 2013 Acura ILX Hybrid ($29,785), which is expected to account for the greenest 20 percent of ILX buyers. It shares its drivetrain with the <a href=\"/toyota/prius/2011/comparison-test.html\">Civic Hybrid</a> and features a 1.5-liter inline-4 engine with a small 17-kilowatt, front-drive electric motor mounted in parallel behind it, and a continuously variable transmission (CVT) behind that. Forty 3.6-volt lithium batteries occupy the trunk, reducing capacity from 12.4 cubic feet to 10 even, but surely you can order a set of custom cloth grocery bags.</p>\n\n<p>Total system power is rated at 111 hp at 5,500 rpm (exactly 1 more hp than the Civic), while torque tops out at 127 lb-ft from 1,000-3,500 rpm. Acura engineers have fiddled with the software, so you get a sharper throttle response for any given pedal input. This, along with the ILX's extra weight, takes a toll on fuel economy ratings, which the company pegs at 39 city/38 highway/38 combined versus 44/44/44 for the Honda.</p>\n\n<p>Of course, like the Honda, the Acura ILX Hybrid feels sluggish if you're thinking about anything other than reducing your environmental footprint. However, we end up enjoying our time on Phoenix's 101 freeway, because the ILX Hybrid has paddle shifters, as well as seven (yes, seven) simulated forward gear ratios. Yank the paddle a couple times and you have enough juice for passing even if you're cruising around in Econ mode.</p>\n\n<p>And if you want something completely different, there's the 2013 ILX 2.4L ($30,095). Acura expects just 5 percent of you to go for this model, the main reason being you can get it only with a six-speed manual gearbox.</p>\n\n<p>The engine is the same sweet-tempered 2.4-liter inline-4 offered in the TSX and <a href=\"/honda/civic/2012/road-test-3/\">Civic Si</a>, and it's rated at 201 hp at 7,000 rpm and 170 lb-ft of torque at 4,400 rpm. We get only 10 minutes in this car, but predictably, this is our favorite engine and we're ripping off heel-and-toe downshifts at 20 mph in the parking lot. Fuel economy estimates are 22 city/31 highway/25 combined.</p>\n\n<p><strong>Solid Chassis</strong><br />\nProbably the most impressive thing about the 2013 Acura ILX is how it rides. Mind you, we're only speaking for Arizona highways, which seem to get more love from the state coffers than our California roads. But there's a new level of compliance here, and it doesn't come at the expense of control over bumps and ruts. It's also a quiet ride, as the ILX has all sorts of noise-reduction measures not found on the Civic, including laminated glass and active noise cancellation (via the audio system).</p>\n\n<p>Suspension design is the same as the Civic's, but Acura engineers have upgraded the dampers and bushings, and those new dampers incorporate rebound springs, which are a means of reducing body roll without resorting to aggressive damping or massive stabilizer bars. It sounds good, but there aren't any serious curves on our route, so we'll reserve judgment on handling until we instrument-test the ILX.</p>\n\n<p>All ILXs get the same basic suspension calibration, which we think might be too soft for the 2.4L model and its high-revving engine. (Along with this caveat comes another: The ILX 2.4L is the only one of the ILX models that can't be equipped with a navigation system, though you can at least have a Premium package with HID headlights.)</p>\n\n<p>You get 17-inch wheels and P215/45R17 Michelin Pilot HX MXM4 all-season tires standard on the ILX 2.4L. These tires are optional on the ILX 2.0L, which along with the ILX Hybrid, comes with standard P205/55R16 Continental ContiProContact all-season rubber. Front brake disc diameter varies by model: The Hybrid has 10.3-inch rotors, the 2.0L has 11.1-inch rotors and the 2.4L gets 11.8-inch rotors. Everybody gets 10.2-inch solid discs in back, and the cast-iron calipers are strictly of the single-piston, sliding variety.</p>\n\n<p>The steering system uses electric assist, but it has a quicker ratio than the Civic &mdash; 15.1:1 versus 16.1. It's precise, with good stability on-center, but we wish it had more feel.</p>\n\n<p><strong>Inconspicuous Consumption</strong><br />\nIf you're still giving unsolicited eulogies to the Integra at dinner parties, then the 2013 Acura ILX probably isn't your car. But if you want a refined compact car that has everything you and your smartphone need and not 1 cubic foot more, there's a case to be made for the ILX over the larger, less efficient cars in this price range.</p>\n\n<p>And we're cautiously hopeful that the ILX might point the way to a renaissance of smaller, lighter cars for the Acura brand.</p>\n\n<p>\"Most of the sales growth is at the entry level, and that requires us to move beyond our volume midsize models, the TL and MDX,\" Jeff Conrad, Acura's vice president of sales and service, told media assembled in Arizona.</p>\n\n<p>Great, we say. Bring on the ILX Type R.</p>\n\n<p><em>Edmunds attended a manufacturer-sponsored event, to which selected members of the press were invited, to facilitate this report.</em></p>\n"
    },
    {
      "title": "2013 Acura ILX Is New Entry Model for the Brand",
      "tags": ["2012 Chicago Auto Show", "news", "Acura", "2013 Acura ILX"],
      "niceNamedTags": [
        "news",
        "2012-chicago-auto-show",
        "2013-acura-ilx",
        "acura"
      ],
      "description": "The new Civic-based Acura ILX goes on sale this spring, in both gasoline and hybrid variants.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/auto-shows/chicago/2012/2013-acura-ilx-is-new-entry-model-for-the-brand-2012-chicago-auto-show.html"
      },
      "authors": [
        {
          "name": "<a rel=\"author\" href=\"/about/authors/paul-lienert.html\">Paul Lienert</a>, Correspondent"
        }
      ],
      "body": "<p class=\"header-2\">2012 Chicago Auto Show</p> \n<p class=\"header-2\">2012 Chicago Auto Show</p><strong>Just the Facts:\n<ul class=\"list-style\">\n<li>The new Civic-based Acura ILX goes on sale this spring, in both gasoline and hybrid variants.</li>\n<li>Acura hopes to attract younger buyers to the brand with its new entry-level sedan.</li>\n</ul>\n</strong>\n<br/>\n\n<p><strong>CHICAGO</strong> &mdash; The new Civic-based 2013 <a href=\"/auto-shows/detroit/2012/acura-ilx-concept-debuts-2012-detroit-auto-show.html\">Acura ILX</a> goes on sale this spring, in both gasoline and hybrid variants.</p>\n\n<p>Acura is hoping to attract younger buyers to the brand with the ILX, which will be built at Honda's Indiana plant. Acura says its target customers are \"successful 20- and 30-somethings\" who are shopping for their first premium car.</p>\n\n<p>First introduced as a concept at last month's <a href=\"/auto-shows/detroit/2012\">2012 Detroit Auto Show</a>, the five-passenger ILX sedan debuts this week in <a href=\"/auto-shows/chicago/2012\">Chicago</a> in final production trim.</p>\n\n<p>The ILX will offer a choice of three powertrains, including a standard 150-horsepower 2.0-liter four-cylinder engine, a 201-hp 2.4-liter four-cylinder engine and Acura's first-ever hybrid, which couples a 1.5-liter four-cylinder engine with a small electric motor.</p>\n\n<p>EPA city/highway fuel economy ratings range from 24/32 mpg for the base 2.0 model to 35/38 mpg for the ILX Hybrid.</p>\n\n<p>Among the car's standard features are keyless access, push-button start, Pandora Internet radio interface and SMS text message function. Premium and Technology packages are also available.</p>\n\n<p><strong>Edmunds.com says:</strong> A bit on the conservative side for younger buyers.<p>\n"
    }
  ],
  "articlesCount": 6,
  "links": [
    {
      "rel": "first",
      "href": "/api/editorial/v2/articles?model=ilx&fmt=json&api_key=sej676rt53rh2cwp9jrcr9h3&year=2013&view=basic&make=acura&pagesize=10&pagenum=1"
    },
    {
      "rel": "last",
      "href": "/api/editorial/v2/articles?model=ilx&fmt=json&api_key=sej676rt53rh2cwp9jrcr9h3&year=2013&view=basic&make=acura&pagesize=10&pagenum=1"
    }
  ]
}
