{
  "articles": [
    {
      "title": "2016 BMW 340i xDrive Long-Term Road Test",
      "tags": [
        "long term road tests",
        "BMW 3 Series",
        "road tests",
        "2016 BMW 3 Series",
        "editor reviews"
      ],
      "niceNamedTags": [
        "2016-bmw-3-series",
        "bmw-3-series",
        "long-term-road-tests",
        "road-tests",
        "editor-reviews"
      ],
      "description": "Our 2016 BMW 340i xDrive had an unscheduled dealer visit for a bubble in the sidewall of one tire. But our service experience left a lasting impression.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-xdrive-disappointing-dealer-service-for-tire-repair.html"
      },
      "authors": [],
      "body": "\n<h3>2016 BMW 340i xDrive: Disappointing Dealer Service for Tire Repair</h3>\n\n<p>by Michael Massey, Vehicle Testing Assistant</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_r34_lt_405171_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n\n\n<p>Content  Strategist Josh Sadlier was the first to spot a bubble in the sidewall of the  left front tire on our <a href=\"/bmw/3-series/2016/long-term-road-test/\">2016 BMW 340i xDrive</a>. He alerted me to it so I called to make an appointment at  Santa Monica BMW. What followed was one of the most off-putting customer  service experiences I've had working in the automotive business.</p>\n\n\n\n<p>I  spoke with the service department operator first. She needed 15 minutes to  change the name on our account from that of the editor who serviced our 340i  before me. I cut her some slack because obviously this request doesn't happen  all that often. Once this was straightened  out, I made an appointment for the same day at 1:30 p.m. After arriving on  time, a porter introduced me to a service  adviser.</p>\n<p>Enter  my inspiration for this story. The adviser  never looked up from his computer and only greeted me verbally. I sat down and  started to count. The adviser fired off the regular menu items regarding our  service (why was I there, do we have an appointment) but wasn't too  enthusiastic about anything. When he finally looked at me, I stopped counting.  It took 30 seconds for him to make eye contact. This was going to be  interesting.</p>\n<p>He  printed the work order for me to review. At the top was the incorrect name and  contact info that I had asked the operator to remove three hours earlier. I  brought this to my adviser's attention and he started making the changes. He  asked, &quot;How do you spell your first name? There are so many ways that I've  seen Michael spelled. I like to ask for clarity.&quot; I appreciated that. The  rest of the summary was as we discussed: Replace both front Pirelli Cinturato  C7 run-flats and a front end alignment. I gave the OK to start work.</p>\n\n<p>My  adviser estimated one hour for the job so I opted to walk back to the office on  a beautiful Santa Monica day. </p>\n<p>Two  hours later a text came through. The car was ready.  Tires cost $264.92 a piece. Labor for tire install was $100. The  alignment was $200. Throw in a few extra small fees and charges and tax and the  grand total settled at $897.59. </p>\n<p>I  walked in to see the service department cashier. A young lady and young man  were behind the desk. Neither greeted me. So I greeted them with a friendly  hello. The young man asked me if I was picking up, seemingly uninterested in  niceties. I gave him my name, he mumbled something into a radio and quietly  took my credit card. As he swiped my card it hit me.</p>\n<p>This  experience was not the way I wanted it to go. There seemed to be a gigantic  lack of customer service from start to finish,  unlike at a <a href=\"/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-first-service-performed-but-well-have-to-go-back.html\">previous service  experience in Fresno</a>. It wasn't the first time we've received such a cold  reception at this service center. We continue to give Santa Monica BMW chances  because of its proximity to our office, but we also continue to have less than  stellar experiences. It's frustrating.</p>\n<p>I  collected my card and my invoice, but it wasn't clear where I was supposed to  pick up our 340i. I turned back around to Mr. Sunshine and asked where I should  go. He directed me outside where I crossed paths with my service adviser, who I  thanked in passing. While in stride he turned to me, cracked his first smile,  shot double finger guns at me and said, &quot;Thanks! And if you see a survey  remember to give me all 10s!&quot; He continued out of view behind a car then  shouted, &quot;Text me if there are any problems!&quot;</p>\n<p>When  I returned to the office, I took another look at the invoice, preparing to  write this update. That's when I noticed the service adviser, despite  specifically asking for clarification, had spelled my name wrong. </p>\n<p>It  looks like Beverly Hills BMW is just 9 miles from the office. Based on our  accrued customer experiences in Santa Monica, I'm going to lobby to have us  switch.</p>\n<p>What  are your thoughts? Have you ever stopped going to a dealership because of poor  customer service? What happens if there isn't another dealership nearby to go  to? </p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_405171_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_405173_717.jpg\" alt=\"2016 BMW 340i xDrive\" /><br>\n  <em>A text message I received from our  service adviser the next day.</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_405172_717.jpg\" alt=\"2016 BMW 340i xDrive\" /><br>\n  <em>A gold foil sticker that's put on  the front of all the dealer's final invoices.</em></p>\n<p>Michael  Massey, Vehicle Testing Assistant @ 22,093 miles</p>\n"
    },
    {
      "title": "2016 BMW 340i xDrive Long-Term Road Test",
      "tags": [
        "long term road tests",
        "BMW 3 Series",
        "road tests",
        "2016 BMW 3 Series",
        "editor reviews"
      ],
      "niceNamedTags": [
        "2016-bmw-3-series",
        "bmw-3-series",
        "long-term-road-tests",
        "road-tests",
        "editor-reviews"
      ],
      "description": "Daily commuting and a weekend road trip made up the bulk of our BMW's time on the road in March. ",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-xdrive-monthly-update-for-march.html"
      },
      "authors": [],
      "body": "\n\n<h3>2016 BMW 340i xDrive: Monthly Update for March</h3>\n\n<p>by Ed Hellwig, Senior Editor</p>\n\n\n<p><strong>Where Did We Drive It?</strong><br>\n  Daily  commuting and a weekend road trip made up the bulk of our <a href=\"/bmw/3-series/2016/\">2016 BMW 340i's</a> time on the road in March. It's a common mix for a lot of 3 Series owners, we  suspect, and this sport sedan handles mundane commutes through the city as well  as it does a winding mountain road. It also delivers pretty impressive mileage  figures, making it well suited to daily driver duty. </p>\n<p>It  wasn't all traffic and potholes, however, as one staffer snagged the sedan for  a weekend golf trip. It put into perspective how much trunk space the 3 Series  has available versus its larger 5 Series sibling. Let's just say that the 3  Series has its limitations. </p>\n\n\n<p><strong>What Kind of Fuel Economy Did It Get</strong></p>\n<p>We  added only about 500 miles to our 340i xDrive in March. As such, our lifetime  average and best fill-up remain unchanged from last month.</p>\n<p>Average lifetime mpg: 23.9<br>\n  EPA mpg rating: 25 combined  (22 city/32 highway)<br>\n  Best fill mpg: 34.6<br>\n  Best range: 518.4 miles<br>\n  Current odometer: 21,518  miles </p>\n<p><strong>Maintenance and Upkeep </strong><br>\n  None.</p>\n<p><strong>Logbook Highlights</strong></p>\n<p><u>Interior</u><br>\n  &quot;I'd  describe the current 3 Series' rear passenger space as just enough. Having  adjusted the driver seat for my long-legged self, I was able to sit behind that  seat with adequate legroom and headroom. The only issue was footroom during  ingress/egress; I had to turn my feet sideways to make it work. But to me,  that's fine for this segment. In other words, please, BMW, don't make the next  3 Series any bigger than this one.&quot; &mdash; <em>Josh Sadlier, Content Strategist</em></p>\n  \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2017/lt/2017_bmw_3-series_rint_lt_33017_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p><u>Cargo  Space</u><br>\n  &quot;I  expected more golf-bag-friendliness from this generously proportioned 3 Series.  Two lightweight bags barely fit in the trunk, and we had to take the driver out  of one of them. Maybe there's a better way to Tetris them in there, but given  that this 3 Series approximates the size of 5 Series past, I figured a couple  of bags would be a breeze. Not so much.&quot; &mdash; <em>Josh Sadlier</em></p>\n  \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2017/lt/2017_bmw_3-series_crg_lt_33017_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p><u>MPG</u><br>\n  &quot;I  continue to be smitten with the fuel efficiency and range this powertrain  provides. On my current fill I've covered about 315 miles in a variety of  conditions, including a lot of stop-and-go, and I've got a quarter-tank  remaining with 29 mpg showing on the trip computer. You'll recall that this is  a conservatively rated 320-horsepower AWD beast that does zero to 60 in the  mid-4s. BMW has unlocked a new level here. I don't love the engine's character,  but I'm astonished by everything else.&quot; &mdash; <em>Josh Sadlier</em></p>\n  \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2017/lt/2017_bmw_3-series_whl_lt_33017_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p><u>Miscellaneous</u><br>\n  &quot;Noticed  one of those distinctive run-flat bulges in the driver-side front tire's  sidewall. No palpable vibration at speed; this was a visual ID while  positioning the front wheels for a photo shoot. Something to take care of in  the near future.&quot;&mdash; <em>Josh Sadlier</em></p>\n"
    },
    {
      "title": "2016 BMW 3 Series Review",
      "tags": ["BMW 3 Series", "2016 BMW 3 Series", "BMW"],
      "niceNamedTags": ["bmw", "2016-bmw-3-series", "bmw-3-series"],
      "description": "The 2016 BMW eDrive 330e is a plug-in hybrid that promises 14 miles of electric range and improved fuel economy.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series-edrive/2016/index.html"
      },
      "authors": [],
      "body": "<p>The 2016 BMW 330e iPerformance  promises hybrid efficiency without sacrificing the impressive driving dynamics  and comfortable, quality interior of a gas-powered 3 Series sedan. Undoubtedly,  the 330e is an impressive piece of engineering. But lackluster electric range  and mileage gains, coupled with the added cost and weight of the hybrid system,  leave that promise largely unfulfilled. </p>\n<p>BMW  has managed to make the battery compact enough to avoid one of the major  pitfalls suffered by other hybrid variants on standard sedans: loss of trunk  space. The downside is that the battery offers only 14 miles of electric range.  Beyond this, electrification has only improved the 330e's fuel economy a meager  3 mpg combined over its gas-powered counterpart, the 330i. The 330e also loses  some acceleration, handling and steering feel. While pursuing efficiency is  praiseworthy, and some extreme examples have proven that hybrid systems can  improve performance, the 330e falls short on both.</p>"
    },
    {
      "title": "Find the Safest Sedans of 2017 for Your Family",
      "tags": [
        "2017 Lexus ES 350",
        "2017 Nissan Altima",
        "2017 Audi A3",
        "Car News",
        "2017 Audi A4",
        "2017 Subaru Legacy",
        "2017 Toyota Prius Prime",
        "2017 Hyundai Elantra",
        "2017 Chevrolet Volt",
        "2017 Genesis G80",
        "2017 Nissan Maxima",
        "2017 Toyota Prius",
        "2017 BMW 3 Series",
        "vehicle safety",
        "2017 Toyota Camry",
        "2017 Toyota Corolla",
        "National Highway Traffic Safety Administration",
        "2017 Mazda 3",
        "2017 Genesis G90",
        "Insurance Institute for Highway Safety",
        "2017 Mazda 6",
        "2017 Volkswagen Jetta",
        "2017 Honda Accord",
        "2017 Volvo S60"
      ],
      "niceNamedTags": [
        "2017-hyundai-elantra",
        "2017-genesis-g90",
        "2017-toyota-camry",
        "2017-volvo-s60",
        "2017-chevrolet-volt",
        "2017-nissan-maxima",
        "2017-toyota-corolla",
        "2017-lexus-es-350",
        "car-news",
        "2017-bmw-3-series",
        "national-highway-traffic-safety-administration",
        "2017-audi-a4",
        "2017-honda-accord",
        "2017-audi-a3",
        "2017-nissan-altima",
        "2017-genesis-g80",
        "insurance-institute-for-highway-safety",
        "2017-volkswagen-jetta",
        "2017-toyota-prius",
        "2017-mazda-6",
        "2017-subaru-legacy",
        "2017-mazda-3",
        "2017-toyota-prius-prime",
        "vehicle-safety"
      ],
      "description": "Looking for the safest sedans of 2017 for your family? Here's the list of top-scoring cars, plus their key optional and standard features.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/car-news/tips-advice/find-the-safest-sedans-of-2017-for-your-family.html"
      },
      "authors": [
        {
          "name": "Edmunds"
        }
      ],
      "body": "<p>Here are the safest sedans of 2017 for your family. For more details, read on: </p>\n\n<p>\n<ul class=\"list-style\">\n<li><a href=\"/audi/a3/\">2017 Audi A3</a></li>\n  <li><a href=\"/audi/a4/\">2017 Audi A4</a></li>\n  <li><a href=\"/bmw/3-series/2017/\">2017 BMW 3 Series</a></li>\n  <li><a href=\"/chevrolet/volt/2017/\">2017 Chevrolet Volt</a></li>\n  <li><a href=\"/genesis/g80/2017/\">2017 Genesis G80</a></li>\n  <li><a href=\"/genesis/g90/2017/\">2017 Genesis G90</a></li>\n  <li><a href=\"/honda/accord/2017/\">2017 Honda Accord</a></li>\n  <li><a href=\"/hyundai/elantra/2017/\">2017 Hyundai Elantra</a></li>\n  <li><a href=\"/lexus/es-350/2017/\">2017 Lexus ES 350</a></li>\n  <li><a href=\"/mazda/3/2017/\">2017 Mazda 3</a></li>\n  <li><a href=\"/mazda/6/2017/\">2017 Mazda 6</a></li>\n  <li><a href=\"/nissan/altima/2017/\">2017 Nissan Altima</a></li>\n  <li><a href=\"/nissan/maxima/2017/\">2017 Nissan Maxima</a></li>\n  <li><a href=\"/subaru/legacy/2017/\">2017 Subaru Legacy</a></li>\n  <li><a href=\"/toyota/camry/2017/\">2017 Toyota Camry</a></li>\n  <li><a href=\"/toyota/corolla/2017/\">2017 Toyota Corolla</a></li>\n  <li><a href=\"/toyota/prius/2017/\">2017 Toyota Prius</a></li>\n  <li><a href=\"/toyota/prius-prime/2017/\">2017 Toyota Prius Prime</a></li>\n  <li><a href=\"/volkswagen/jetta/\">2017 Volkswagen Jetta</a></li>\n  <li><a href=\"/volvo/s60/2017/\">2017 Volvo S60</a></li>\n</ul>\n</p>\n\n<p>If you're shopping for a new family sedan, safety is undoubtedly high on your list of must-haves. But it's not always easy to sort out which sedans are the very safest, and we bring you this list to make the job easier. It shows the 2017 sedans that have received both the highest rating, <a href=\"http://www.iihs.org/iihs/ratings/TSP-List\" target=\"_blank\">Top Safety Pick+</a>, from the Insurance Institute for Highway Safety (IIHS) andthe top five-star overall rating from the National Highway Traffic Safety Administration's <a href=\"//www.nhtsa.gov/ratings\" target=\"_blank\">5-Star Safety Ratings</a> testing. NHTSA does not test all cars, however, so we've also included 2017 sedans that have not been tested by NHTSA but that have received the IIHS Top Safety Pick+ rating. </p>\n\n<p>Of course, all the sedans on this list have the safety equipment that federal law requires, including front-seat airbags for the driver and front passenger, tire-pressure monitoring systems and electronic stability control (ESC). ESC incorporates antilock brakes and traction control. </p>\n\n<p>We've also listed some of the key safety features in each car and safety-related extras that might interest you. When Edmunds has tested a vehicle, we show the results of our own brake tests. The cars are listed alphabetically within three size groups: compact, midsize and large sedans. We've also included four-door hatchbacks, such as the 2017 Toyota Prius and the Prius Prime plug-in hybrid, that meet our \"safest\" criteria. </p>\n\n<p><strong>Compact Sedans</strong></p>\n\n<p><a href=\"/chevrolet/volt/2017/hatchback/\">2017 Chevrolet Volt</a></p>\n \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/chevrolet/volt/2017/ns/2017_chevrolet_volt_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/chevrolet/volt-4-door-hatchback\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in the <a href=\"//www.chevrolet.com/volt-electric-car/specs/trims.html\" target=\"_blank\">Driver Confidence II package</a> with the Premier trim)</p>\n\n<p>NHTSA 5-Star overall rating </p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver and front-passenger knee airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Pedestrian detection with automatic braking</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra</strong>: The optional advanced safety features are part of the <a href=\"//www.chevrolet.com/volt-electric-car/specs/trims.html\" target=\"_blank\">Driver Confidence II</a> package, available only on the Premier trim level with the Driver Confidence I package.</p>\n\n<p><strong>Edmunds brake testing</strong>: In Edmunds testing, a 2017 Chevrolet Volt came to a stop from 60 mph in 119 feet, which is average for the class.</p>\n\n<p><a href=\"/hyundai/elantra/2017/sedan/\">2017 Hyundai Elantra</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/hyundai/elantra/2017/ns/2017_hyundai_elantra_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/hyundai/elantra-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in the <a href=\"//www.hyundaiusa.com/elantra/specifications.aspx\" target=\"_blank\">Ultimate</a> package and adaptive HID projector headlights in the Limited trim with the Ultimate package; applies only to sedans built after March 2016)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver knee airbag</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Rear cross-traffic alert</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Something extra</strong>: Forward collision warning with automatic braking, adaptive headlights and other advanced safety features are part of the <a href=\"//www.hyundaiusa.com/elantra/specifications.aspx\" target=\"_blank\">Ultimate</a> package, which requires the <a href=\"//www.hyundaiusa.com/elantra/specifications.aspx\" target=\"_blank\">Tech</a> package and is only available on the Limited trim level.</p>\n\n<p><strong>Edmunds brake testing</strong>: Not rated</p>\n\n<p><a href=\"/mazda/3/2017/sedan/\">2017 Mazda 3</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mazda/3/2017/ns/2017_mazda_3_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/mazda/3-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in the <a href=\"http://www.mazda.com/en/innovation/technology/safety/i-activsense/\" target=\"_blank\">i-Activsense</a> package and adaptive LED projector headlights in the Grand Touring trim equipped with the <a href=\"//www.mazdausa.com/vehicles/mazda3-sedan/specs\" target=\"_blank\">Premium Equipment</a> package and i-Activsense)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong> <br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Pedestrian detection with automatic braking</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra</strong>: New for the Mazda 3 in 2017 is Mazda's <a href=\"//www.mazdausa.com/why-mazda/skyactiv-vehicle-dynamics\" target=\"_blank\">G-Vectoring Control</a>, a sophisticated system that improves handling and can provide better control in emergency situations.</p>\n\n<p><strong>Edmunds brake testing</strong>: In Edmunds testing, a 2017 Mazda 3 came to a stop from 60 mph in 120 feet, which is average for the class.</p>\n\n<p><a href=\"/toyota/corolla/2017/sedan/\">2017 Toyota Corolla</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/toyota/corolla/2017/ns/2017_toyota_corolla_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/toyota/corolla-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a></p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver knee airbag</li>\n<li>Adaptive cruise control</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Hill start assist</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Pedestrian detection</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>None</li></ul></p>\n\n<p><strong>Something extra</strong>: All of the advanced safety features are part of the <a href=\"http://www.toyota.com/safety-sense/\" target=\"_blank\">Toyota Safety Sense P</a> system, which is now standard equipment on the Corolla.</p>\n\n<p><strong>Edmunds brake testing</strong>: In Edmunds testing, a 2017 Corolla LE with the standard rear drum brakes (rear disc brakes are standard on higher trim levels) stopped from 60 mph in 130 feet, which is longer than average for the class.</p>\n\n<p><a href=\"/toyota/prius/2017/hatchback/\">2017 Toyota Prius</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/toyota/prius/2017/ns/2017_toyota_prius_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/toyota/prius-4-door-hatchback/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (applies only to vehicles built after March 2016)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver knee airbag</li>\n<li>Adaptive cruise control</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Hill start assist</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Pedestrian detection</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Blind-spot monitoring</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra</strong>: Also available is Toyota's <a href=\"http://www.toyota.com/safety-connect/\" target=\"_blank\">Safety Connect</a> subscription service, which includes emergency assistance, stolen vehicle locator, roadside assistance and automatic collision notification.</p>\n\n<p><strong>Edmunds brake testing</strong>: In Edmunds testing, a 2017 Toyota Prius came to a stop from 60 mph in 120 feet, which is average for the class.</p>\n\n<p><a href=\"/volkswagen/jetta/?sub=sedan\">2017 Volkswagen Jetta</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/volkswagen/jetta/2017/ns/2017_volkswagen_jetta_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/volkswagen/jetta-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in SEL and SEL Premium trims and adaptive HID projector headlights in SEL Premium trim and Sport trim with <a href=\"//www.vw.com/models/jetta/2016-sport-lighting/\" target=\"_blank\">Lighting</a> package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra</strong>: The available Volkswagen <a href=\"http://vwcarnet.com/\" target=\"_blank\">Car-Net</a> system includes automatic crash notification, roadside assistance, remote vehicle access, stolen vehicle location and geo-fencing, which allows parents to set boundaries for teenage drivers.</p>\n\n<p><strong>Edmunds brake testing</strong>: In Edmunds testing, a 2017 Jetta SE came to a stop from 60 mph in 118 feet, which is shorter than average for the class.</p>\n\n<p><strong>Midsize Sedans</strong></p>\n\n<p><a href=\"/audi/a3/2017/sedan/\">2017 Audi A3</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/audi/a3/2017/ns/2017_audi_a3_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/audi/a3-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional automatic LED projector headlights in Prestige trim and Premium Plus trim with <a href=\"//www.audiusa.com/technology/design/LED\" target=\"_blank\">LED Lighting</a> package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver and front-passenger knee airbags</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Pedestrian detection with automatic braking</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Rear-seat side airbags</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li></ul></p>\n\n<p><strong>Something extra:</strong> The <a href=\"//www.audiusa.com/technology/design/LED\" target=\"_blank\">LED Lighting</a> package, available with the Prestige and Premium Plus trim levels, replaces the standard HID headlights with automatic LED projector headlights.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, an all-wheel-drive 2017 Audi A3 came to a stop from 60 mph in 118 feet, which is a shorter than average for the class.</p>\n\n<p><a href=\"/audi/a4/2017/sedan/\">2017 Audi A4</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/audi/a4/2017/ns/2017_audi_a4_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/audi/a4-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with automatic LED projector headlights in Prestige trim equipped with <a href=\"//www.audiusa.com/myaudi/offers-programs/audi-features\" target=\"_blank\">Driver Assistance</a> package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Pedestrian detection with automatic braking</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Rear-seat side airbags</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li></ul></p>\n\n<p><strong>Something extra:</strong> The available <a href=\"//www.audiusa.com/technology/intelligence/audi-connect\" target=\"_blank\">Audi Connect</a> system in the <a href=\"//www.audiusa.com/models/audi-a4?CSREF=sem%7c10770960%7c3118667%7c144106565%7c315947276&adometry=121620855%7c4436&gclid=CjwKEAiArbrFBRDL4Oiz97GP2nISJAAmJMFa6cqPBmSe2zZOl2geuyv7Bb-HDOkUCI3XoINlkFSz5RoCH4Pw_wcB\" target=\"_blank\">Technology</a> package provides automatic crash notification, SOS emergency response, geo-fencing alerts (for location, speed and curfew) and a stolen vehicle locator.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Audi A4 Quattro with optional summer tires came to a stop from 60 mph in 99 feet, which is much shorter than average for the class.</p>\n\n<p><a href=\"/bmw/3-series/2017/sedan/\">2017 BMW 3 Series</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2017/ns/2017_bmw_3-series_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/bmw/3-series-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in <a href=\"http://www.bmw.com/com/en/newvehicles/3series/sedan/2015/showroom/driver_assistance.html\" target=\"_blank\">Driver Assistance Plus</a> package and adaptive LED reflector headlights in <a href=\"http://www.bmw.com/com/en/newvehicles/3series/sedan/2015/showroom/design.html\" target=\"_blank\">Lighting</a> package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver and front-passenger knee airbags</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>360-degree camera</li>\n<li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Pedestrian detection</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Something extra:</strong> <a href=\"//www.bmwusa.com/Standard/Content/Explore/BMWValue/BMWAssist/2014andlater.aspx\" target=\"_blank\">BMW Assist</a> emergency communications system is standard and includes automatic crash notification, stolen vehicle recovery and on-demand roadside assistance.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 BMW 328i xDrive came to a stop from 60 mph in 113 feet, which is better than average for the class.</p>\n\n<p><a href=\"/honda/accord/2017/sedan/\">2017 Honda Accord</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/accord/2017/ns/2017_honda_accord_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/honda/accord-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in the <a href=\"//automobiles.honda.com/sensing/\" target=\"_blank\">Honda Sensing</a> package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive cruise control</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li></ul></p>\n\n<p><strong>Something extra:</strong> The available <a href=\"//automobiles.honda.com/sensing/\" target=\"_blank\">Honda Sensing</a> package &mdash; which includes adaptive cruise control, forward collision warning with automatic braking, lane departure warning and lane keeping assist &mdash; can be added to all Accord trim levels.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Honda Accord EX-L came to a stop from 60 mph in 117 feet, which is shorter than average for the class.</p>\n\n<p><a href=\"/lexus/es-350/2017/sedan/\">2017 Lexus ES 350</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/lexus/es-350/2017/ns/2017_lexus_es-350_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/lexus/es-350-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional automatic LED projector headlights)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver and front-passenger knee airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra:</strong> Also standard is the <a href=\"http://drivers.lexus.com/lexusdrivers/technology/enform/Safety-Connect/\" target=\"_blank\">Lexus Safety Connect</a> system, which includes automatic collision notification, stolen vehicle location and an emergency assistance button.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Lexus ES 350 came to a stop from 60 mph in 130 feet, which is a longer than average for the class.</p>\n\n<p><a href=\"/mazda/6/2017/sedan/\">2017 Mazda 6</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mazda/6/2017/ns/2017_mazda_6_f34_ns_2281718_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/mazda/6-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in Touring trim and Grand Touring trim and adaptive LED projector headlights in Grand Touring trim and Touring trim equipped with <a href=\"//www.mazdausa.com/vehicles/mazda6/specs\" target=\"_blank\">Touring Premium</a> package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags </li>\n<li>Full-length side curtain airbags</li>\n<li>Active front head restraints</li>\n<li>Hill start assist</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Rear cross-traffic alert</li>\n<li>Pedestrian detection</li></ul></p>\n\n<p><strong>Something extra:</strong> The available <a href=\"//www.mazdausa.com/vehicles/mazda6/features\" target=\"_blank\">Traffic Sign Recognition</a> system is able to detect and read such indicators as speed limit signs, stop signs and \"do not enter\" signs, and display them on the vehicle's Active Driving Display. In some situations, such as if you're exceeding the speed limit, the system might also sound a warning.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Mazda 6 came to a stop from 60 mph in 124 feet, which is average for the class.</p>\n\n<p><a href=\"/nissan/altima/2017/sedan/\">2017 Nissan Altima</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/nissan/altima/2017/ns/2017_nissan_altima_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/nissan/altima-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash prevention in <a href=\"//www.nissanusa.com/cars/altima/versions-specs\" target=\"_blank\">Technology</a> package and LED projector headlights in 2.5 SR trim with <a href=\"//www.nissanusa.com/cars/altima/versions-specs/version.2-5-sr.html\" target=\"_blank\">LED Appearance</a> package, 2.5 SL trim with Technology package, 3.5 SR trim and 3.5 SL trim)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbag</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Rearview camera</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra:</strong> The available <a href=\"//www.nissanusa.com/connect\" target=\"_blank\">NissanConnect</a> system includes automatic collision notification, emergency assistance and stolen vehicle location services.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Nissan Altima stopped from 60 mph in 122 feet, which is slightly below average for the class.</p>\n\n<p><a href=\"/nissan/maxima/2017/sedan/\">2017 Nissan Maxima</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/nissan/maxima/2017/ns/2017_nissan_maxima_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/nissan/maxima-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> ( with optional front crash protection in <a href=\"//www.nissanusa.com/cars/maxima/versions-specs\" target=\"_blank\">Technology</a> package and LED projector headlights in SR trim, SR midnight trim and Platinum trim)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>360-degree camera</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Driver drowsiness alert</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra:</strong> The available <a href=\"http://www.nissan-global.com/EN/TECHNOLOGY/OVERVIEW/active_trace_control.html\" target=\"_blank\">Active Trace Control</a> system can help drivers maintain control in corners by automatically applying the brake at each wheel as required.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Nissan Maxima Platinum with all-season tires stopped from 60 mph in 122 feet, which is slightly below average for the class.</p>\n\n<p><a href=\"/subaru/legacy/2017/sedan/\">2017 Subaru Legacy</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/subaru/legacy/2017/ns/2017_subaru_legacy_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/subaru/legacy-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional front crash protection in the <a href=\"//www.subaru.com/engineering/eyesight.html\" target=\"_blank\">EyeSight Driver Assist Technology</a> package and adaptive HID headlights in 2.5i Limited and 3.6R Limited trim levels equipped with EyeSight Driver Assist Technology package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Front-seat cushion airbags</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Pedestrian detection with automatic braking</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra:</strong> The available <a href=\"//www.subaru.com/engineering/eyesight.html\" target=\"_blank\">EyeSight Driver Assist Technology</a> package, which includes most of the advanced safety features, can be added to all Legacy trim levels except the base 2.5i.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Subaru Legacy 2.5i Premium stopped from 60 mph in 114 feet, which is shorter than average for the class.</p>\n\n<p><a href=\"/toyota/camry/2017/sedan/\" target=\"_blank\">2017 Toyota Camry</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/toyota/camry/2017/ns/2017_toyota_camry_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/toyota/camry-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> ( with optional front crash protection in <a href=\"http://www.toyota.com/camry/features/packages/2532/2540/2546/2548\" target=\"_blank\">Technology</a> package and halogen projector headlights in the XLE, XSE, and Hybrid XLE trims with the Technology package)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver and front-passenger knee airbags</li>\n<li>Rear-seat side airbags</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Hill start assist</li>\n<li>Lane departure warning</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra:</strong> The available Toyota <a href=\"http://www.toyota.com/safety-connect/\" target=\"_blank\">Safety Connect</a> subscription system includes emergency assistance, stolen vehicle locator, roadside assistance and automatic collision notification. </p>\n\n<p><strong>Edmunds brake testing:</strong> Not rated</p>\n\n<p><a href=\"/toyota/prius-prime/2017/hatchback/\">2017 Toyota Prius Prime</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/toyota/prius-prime/2017/ns/2017_toyota_prius-prime_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/toyota/prius-prime-4-door-hatchback/2017\" target=\"_blank\">IIHS Top Safety Pick+</a></p>\n\n<p>NHTSA 5-Star overall rating: Not rated</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver knee airbag</li>\n<li>Passenger seat cushion airbag</li>\n<li>Adaptive cruise control</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Hill start assist</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Pedestrian detection</li>\n<li>Rearview camera</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Blind-spot monitoring</li>\n<li>Rear cross-traffic alert</li></ul></p>\n\n<p><strong>Something extra:</strong> The available Toyota <a href=\"http://www.toyota.com/safety-connect/\" target=\"_blank\">Safety Connect</a> system includes emergency assistance, stolen vehicle locator, roadside assistance and automatic collision notification.</p>\n\n<p><strong>Edmunds brake testing:</strong> Not rated</p>\n\n\n<p><a href=\"/volvo/s60/2017/sedan/\">2017 Volvo S60</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/volvo/s60/2017/ns/2017_volvo_s60_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/volvo/s60-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a> (with optional adaptive HID projector headlights in Dynamic trim and Inscription trim with <a href=\"http://www.volvocars.com/us/cars/new-models/s60/specifications\" target=\"_blank\">Technology</a> package, Polestar trim, Inscription Platinum trim and R-Design trim)</p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Pedestrian detection with automatic braking</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Rear cross-traffic alert</li>\n<li>Rearview camera</li>\n<li>Driver drowsiness alert</li></ul></p>\n\n<p><strong>Something extra:</strong> Also standard is Volvo's <a href=\"http://www.volvocars.com/intl/own/connectivity/volvo-on-call\" target=\"_blank\">On Call</a> system, which includes emergency assistance, automatic crash notification and stolen vehicle assistance.</p>\n\n<p><strong>Edmunds brake testing:</strong> In Edmunds testing, a 2017 Volvo XC60 T6 Drive-E stopped from 60 mph in 120 feet, which is average for the class.</p>\n\n<p><strong>Large Sedans</strong></p>\n\n<p><a href=\"/genesis/g80/2017/sedan/\">2017 Genesis G80</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/genesis/g80/2017/ns/2017_genesis_g80_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/genesis/g80-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a></p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver knee airbag</li>\n<li>Rear-seat side airbags</li>\n<li>Active head restraints</li>\n<li>Rearview camera</li>\n<li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Rear cross-traffic alert</li>\n<li>Pedestrian detection</li>\n<li>360-degree camera</li>\n<li>Driver drowsiness alert</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>None</li></ul></p>\n\n<p><strong>Something extra:</strong> Also standard is the <a href=\"//www.genesis.com/us/en/genesis-owners.html\" target=\"_blank\">Genesis Connected Services</a> system, which includes an SOS button, vehicle locator, on-demand roadside assistance, remote door unlocking and remote start, stolen vehicle slowdown/immobilization/recovery and turn-by-turn navigation.</p>\n\n<p><strong>Edmunds brake testing:</strong> Not rated</p>\n\n<p><a href=\"/genesis/g90/2017/sedan/\">2017 Genesis G90</a></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/genesis/g90/2017/ns/2017_genesis_g90_f34_ns_228171_600.jpg\" alt=\"Safest Sedans for 2017\"></p>\n\n<p><a href=\"http://www.iihs.org/iihs/ratings/vehicle/v/genesis/g90-4-door-sedan/2017\" target=\"_blank\">IIHS Top Safety Pick+</a></p>\n\n<p>NHTSA 5-Star overall rating</p>\n\n<p><strong>Key Safety Features</strong></p>\n\n<p><strong>Standard:</strong><br>\n<ul class=\"list-style\"><li>Front-seat side airbags</li>\n<li>Full-length side curtain airbags</li>\n<li>Driver knee airbag</li>\n<li>Rear-seat side airbags</li>\n<li>Active head restraints</li>\n<li>Rearview camera</li>\n<li>Adaptive headlights</li>\n<li>Adaptive cruise control</li>\n<li>Blind-spot monitoring</li>\n<li>Forward collision warning with automatic braking</li>\n<li>Lane departure warning</li>\n<li>Lane keeping assist</li>\n<li>Rear cross-traffic alert</li>\n<li>Pedestrian detection</li>\n<li>360-degree camera</li>\n<li>Driver drowsiness alert</li></ul></p>\n\n<p><strong>Optional: </strong><br>\n<ul class=\"list-style\"><li>None</li></ul></p>\n\n<p><strong>Something extra:</strong> Also standard is <a href=\"//www.genesis.com/us/en/genesis-owners.html\" target=\"_blank\">Genesis Connected Services</a>, which includes an SOS button, vehicle locator, on-demand roadside assistance, remote door unlocking and remote start, stolen vehicle slowdown/immobilization/recovery and turn-by-turn navigation.</p>\n\n<p><strong>Edmunds brake testing:</strong> Not rated</p>"
    },
    {
      "title": "2016 BMW 340i xDrive Long-Term Road Test",
      "tags": [
        "long term road tests",
        "BMW 3 Series",
        "road tests",
        "2016 BMW 3 Series",
        "editor reviews"
      ],
      "niceNamedTags": [
        "2016-bmw-3-series",
        "bmw-3-series",
        "long-term-road-tests",
        "road-tests",
        "editor-reviews"
      ],
      "description": "Check out the latest on our long-term 2016 BMW 340i xDrive for the month of February, including road-trip impressions and fuel economy.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-xdrive-monthly-update-for-february-2017.html"
      },
      "authors": [],
      "body": "\n\n<h3>2016 BMW 340i xDrive: Monthly Update for February 2017</h3>\n\n<p>by Will Kaufman, Associate Automotive Editor</p>\n\n<p><strong>Where Did We Drive It?</strong></p>\n<p>This  month our <a href=\"/bmw/3-series/2016/\">2016 BMW 340i xDrive</a> did plenty of commuting, but it also took a few breaks for  weekend getaways. A trip to San Francisco saw the all-wheel drive come in handy  during a torrential downpour, although the adaptive cruise control system's  sensors didn't fare so well. After that adventure, the 340i probably  appreciated being taken to a spa in the desert near Palm Springs, even if it  couldn't relax in the natural thermal baths.</p>\n<p>Whatever  the destination, the 340i remains much in demand for its comfort, poise and  speed. However, not everything is wine and roses with our Jatoba Brown  Bavarian. Concerns have emerged that the 3 Series feels less special than it  once did, even as it gains features that should make it more competitive on the  market.</p>\n\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_22517_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p><strong>What Kind of Fuel Economy Did It  Get?</strong><br>\n  February's  miles included two longer freeway journeys, which bumped up fuel economy a bit  over January. Alas, the daily L.A. slog and periodic dips into the louder end  of the 3.0-liter engine's rev range kept us from getting close to our lifetime  best.</p>\n  \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_f34_lt_2271703_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p>Still,  our average in February was 24.8 mpg, which is right in line with EPA  estimates. The BMW has done remarkably well here despite that marvelous engine,  which continually tempts us to misbehave. </p>\n<p>Average lifetime mpg: 23.9<br>\n  EPA mpg rating: 25 combined (22 city/32 highway)<br>\n  Best fill mpg: 34.6<br>\n  Best range: 518.4 miles<br>\n  Current odometer: 21,025  miles</p>\n<p><strong>Maintenance and Upkeep </strong><br>\n  None.</p>\n<p><strong>Logbook Highlights</strong></p>\n<p><u>Performance</u><br>\n  &quot;Perhaps  a day will come when we're all zipping around in electric pods and the closest  thing to an engine note is whatever's being pumped through the speakers. But  we're hardly there yet, so I still have certain expectations for how a  high-performance engine ought to sound. BMW, of course, has historically made  some of the sweetest-sounding sixes in the business, and even its first  turbocharged inline-six &mdash; the twin-turbo N54 &mdash; had a  satisfyingly silken growl. I'm a little concerned about the company's latest  efforts, however, including the admittedly potent lump under the hood of our  340i. </p>\n<p>&quot;To  me, this turbo-six is the ultimate performance appliance: It's astonishingly  capable and fuel-efficient, but it sounds hollow and uninspired, like a  world-beating vacuum cleaner. Before you tell me that no one cares, let me tell  you about Ferrari, which built its peerless brand in significant part on the  music its engines emit. Between the 340i's underwhelming acoustics and the  current M3's need for synthetic enhancement (see 'pumped through the speakers,'  above), I'm afraid the F30 3 Series will be known as the generation when BMW's  music died.&quot; &mdash; <em>Josh  Sadlier, Content Strategist</em></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_rear_lt_22817_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p>&quot;It's  strange to drive a car with a communicative chassis and uncommunicative  steering. My rear end tells me that I just hit a midcorner bump, but as far as  the steering wheel is concerned I might as well be on a glass-smooth track.  That said, it's a pleasant commuter car. Eco Pro mode has a function that  allows you to coast like you would in a manual, where neutral is easily accessible.  It's very intuitive and makes negotiating midspeed traffic much easier. But for  sitting in summer traffic, I'd want to reconfigure Eco Pro to allow for full  A/C.&quot; &mdash; <em>Will Kaufman,  Associate Automotive Editor</em></p>\n<p><u>Interior</u><br>\n  &quot;Trunk space is deep but narrow,  and rear seat space is borderline marginal, but that's OK because the front  seats are comfortable and very adjustable.&quot; &mdash; <em>Calvin Kim, Road Test Editor</em></p>\n<p>&quot;I  find it a little odd that there isn't a 'sync' button for the A/C system, so  you always have to adjust driver and passenger temps separately. Or am I  missing something?&quot; &mdash; <em>Jonathan  Elfalan, Senior Road Test Editor</em></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_int_lt_22817_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n\n<p><u>Audio  & Technology</u><br>\n  &quot;I'm  disappointed anew every time I fire up the 340i's standard 16-speaker Harman  Kardon audio system, which is the optional premium upgrade on lesser 3 Series  models. If I didn't know the specs, I'd guess it was the entry-level stereo  instead. The bass isn't rich, the highs aren't crisp and the soundstage isn't  full. I've played with all the settings; it just sounds flat no matter what.  This is in stark contrast to the early E90 (previous-generation) 3 Series,  which came standard with a dual-subwoofer 10-speaker setup that genuinely  cranked. Also, the E90 M3's optional stereo was a high-powered beast, as I  recall (it was in our <a href=\"/bmw/m3/2009/long-term-road-test/\">2009 long-termer</a>). But BMW removed features from the standard stereo toward  the end of the E90's run, and it sounds to me like that approach persists  today. Pity. I used to look forward to the listening experience whenever a 3  Series came around.&quot; &mdash; <em>Josh  Sadlier</em></p>\n  \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_22717_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p>&quot;Although the 3 Series is showing  its age, the modern tech is all there. During my 200 miles with the car, I  became very familiar with the radar cruise control and real-time traffic  display on the navigation screen, as many of the miles were spent in  bumper-to-bumper traffic going down to visit family and run errands in Orange  County. On top of the iDrive controller is a small touchpad surface, and I  found myself writing the letters to find destinations and input addresses far  more often than using the scroll wheel to make selections. The iDrive system  reads back the letters to you, so you can legitimately enter text without  looking at the display.&quot; &mdash; <em>Calvin  Kim</em></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_fint_lt_22717_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p><u>Miscellaneous</u><br>\n  &quot;While  it might be objectively one of the best-performing cars in the fleet, I just  can't seem to connect with our 3 Series. Yes, it's fast; yes, it handles  extremely well; but it feels so devoid of character. Maybe it's the  brown-on-brown-on-brown color scheme of our car, but this thing just doesn't  stand out. At least in black, our old ATS stood out a bit. It was more  aggressively styled, too. This Bimmer feels like one of a million here in L.A.  And that certainly doesn't help the vibe I get while driving it.&quot;  &mdash; <em>Travis Langness, Automotive  Editor</em></p>\n  \n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_prf_lt_22717_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>"
    },
    {
      "title": "2016 BMW 340i xDrive Long-Term Road Test",
      "tags": [
        "long term road tests",
        "BMW 3 Series",
        "road tests",
        "2016 BMW 3 Series",
        "editor reviews"
      ],
      "niceNamedTags": [
        "2016-bmw-3-series",
        "bmw-3-series",
        "long-term-road-tests",
        "road-tests",
        "editor-reviews"
      ],
      "description": "Braving the weather and traffic of Southern California's limited rainy season, our BMW 340i shows some weaknesses and strengths.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-xdrive-monthly-update-for-january-2017.html"
      },
      "authors": [],
      "body": "\n\n<h3>2016 BMW 340i xDrive: Monthly Update for January 2017</h3>\n\n<p>by Calvin Kim, Road Test Editor</p>\n\n\n\n<p><strong>Where Did We Drive It?</strong><br>\n  January was a busy month for our all-wheel-drive <a href=\"/bmw/3-series/2016/sedan/\">2016 BMW 340i xDrive</a>, and as the miles have steadily  piled on, we've grown accustomed to the character of BMW's most popular sedan.  Along the way, we've noticed some of the smaller details that long-term tests  are designed to highlight, and we've even discovered some new quirks. In  particular, Southern California's once-in-a-decade winter rainstorms wreaked  havoc on our already challenged roads and brought forth an issue that many in  snow country will surely experience. </p>\n<p>Being the tail end of the holiday season, the first half of  January allowed some of our editors to spend extended quality time behind the  wheel. This is a rare treat &mdash; we're usually swapping in and out of  cars two to three times a week. The second half was back to business as usual,  with the 340i trading hands in quick succession and getting back to commuting  duty.</p>\n<p><strong>What Kind of Fuel Economy Did It  Get?</strong><br>\n  We filled up five times over the course of over 1,600 miles,  and saw an overall average of 20.5 mpg (high of 22.4 mpg, low of 18.9 mpg)  during the month of January. Credit this to city driving, sitting in traffic  and enjoying the 320 horsepower from the inline-six engine.</p>\n<p>These results aren't uncommon for the BMW, but it goes to  show you that your results will definitely vary based on usage patterns.</p>\n<p>Average  lifetime mpg: 24.1<br>\n  EPA mpg  rating: 25 combined (22 city/32 highway)<br>\n  Best fill  mpg: 34.6<br>\n  Best  range: 518.4 miles<br>\n  Current  odometer: 19,266 miles</p>\n<p><strong>Maintenance and Upkeep </strong><br>\n  None.</p>\n<p><strong>Logbook Highlights</strong></p>\n<p><u>Performance</u><br>\n  &quot;As others have reiterated, the different drive modes  (Sport, Comfort and Eco Pro) really change the behavior of the car. Comfort is  good, but Sport is better. I tended to avoid Eco Pro as it reduced the  responsiveness of the throttle and transmission beyond the range of  acceptability.&quot; &mdash; <em>Calvin  Kim, Road Test Editor</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_prf_lt_13017_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n<p><u>Interior</u><br>\n  &quot;This will sound odd, but I've often appreciated the  way BMW does sun visors, and the 340i is no exception. There's a lot of  resistance to motion, and this is good &mdash; it means the visor (when in  the side window position) doesn't swing around and hit me in the face when  making moderately spirited left turns.&quot; &mdash; <em>Jason Kavanagh, Engineering Editor</em></p>\n<p><u>Technology-Audio</u><br>\n  &quot;Torrential downpours greeted me as I departed Santa  Barbara en route to Los Angeles. In the rain the 340i is as stable and  confidence-inspiring as you'd expect. The rain-sensing wipers erred on the side  of too infrequent for my liking, so I preferred the regular, dumb settings  instead. No big deal. Heaps of traction is afforded by its AWD, which allowed  me to deploy the 340i's considerable thrust without experiencing  wheelspin.&quot; &mdash; <em>Jason  Kavanagh</em></p>\n<p>&quot;The radar system is smooth and reacts efficiently,  although it takes the computer a moment to decide when a new lead car is  relevant, leading to some harrowing moments of doubt about whether the BMW  would stop itself in time.&quot; &mdash; <em>Calvin Kim</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_130171_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n<p>&quot;The frontal collision/adaptive cruise dingus doesn't  like the rain. It chimed in with this display during my drive. It's an  informative alert to be sure. As an aside, I predict that our inevitable  autonomous future will be replete with sensor-washing systems, perhaps each  with its own redundant system. Adaptive cruise was also disabled during my  drive, which is no surprise since its function piggybacks on the frontal  collision detection system. There is, apparently, a way to revert it to  conventional 'dumb' cruise in this situation, but I was not in a position to  research the owner's manual as directed (because driving). I instead futzed  around with the cruise interface, holding buttons and such in a futile attempt  to enable it via intuition. Oddly enough, the adaptive cruise would return if I  cycled the 'power' on the cruise. Then it would click off again with the alert  above after several minutes. There was really no rhyme or reason to the  interval. Everything worked fine again once dry (and with no manual cleaning of  the sensor), which leads me to believe this might be a maintenance item to  check during its next service.&quot; &mdash; <em>Jason Kavanagh</em></p>\n  <p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_13017_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n"
    },
    {
      "title": "The 12 Best All-Wheel-Drive Sedans Under $35,000",
      "tags": [
        "2017 MINI Clubman",
        "2017 Dodge Charger",
        "2017 Audi A3",
        "Car News",
        "2017 Subaru Legacy",
        "2017 Subaru WRX",
        "2017 Subaru Impreza",
        "2017 Chrysler 200",
        "2017 Buick Regal",
        "2017 Mitsubishi Lancer",
        "2017 Ford Fusion",
        "2017 BMW 3 Series",
        "2017 Mercedes-Benz CLA-Class"
      ],
      "niceNamedTags": [
        "2017-mini-clubman",
        "2017-subaru-wrx",
        "2017-mitsubishi-lancer",
        "car-news",
        "2017-bmw-3-series",
        "2017-buick-regal",
        "2017-audi-a3",
        "2017-ford-fusion",
        "2017-subaru-impreza",
        "2017-mercedes-benz-cla-class",
        "2017-subaru-legacy",
        "2017-dodge-charger",
        "2017-chrysler-200"
      ],
      "description": "Here are well-equipped, comfortable AWD sedans that look and handle like cars but provide extra traction in a variety of conditions. ",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/car-news/tips-advice/the-12-best-all-wheel-drive-sedans-under-35000.html"
      },
      "authors": [
        {
          "name": "Edmunds"
        }
      ],
      "body": "<p>All-wheel drive is not just for pickups and SUVs anymore. Now many automakers offer shoppers a selection of well-equipped, comfortable AWD sedans that provide extra traction in a variety of conditions but look and handle like cars. And although most of these vehicles don't have off-road pretensions, they can be a great choice for those who live where snow, ice and wet roads are a way of life.</p>\n\n<p>Here, listed alphabetically, are a dozen AWD sedans that rate highly with us. All of them have a starting manufacturer's suggested retail price of less than $35,000 (before destination charges), and some are well below that figure. As you shop, you will likely find better prices than those shown here, particularly if <a href=\"/car-incentives/\">incentives</a> are available. </p>\n\n<p>1. <a href=\"/audi/a3/2017/sedan/\">2017 Audi A3 Quattro</a> (compact car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/audi/a3/2017/fe/2017_audi_a3_f34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>The 2017 Audi A3 Quattro is proof that a premium-brand AWD sedan can be yours at a reasonable price, assuming you don't succumb to the extensive options sheet. And, really, that isn't necessary since the entry-level A3 Quattro will satisfy most buyers with its comprehensive list of standard comfort and convenience features, not to mention Audi's highly regarded AWD system. The 2017 Audi A3 Quattro is EPA-rated at 27 mpg combined (24 city/31 highway). Starting MSRP: $34,200.</p>\n\n<p>2. <a href=\"/bmw/3-series/2017/\">2017 BMW 320i xDrive</a> (compact car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2017/fe/2017_bmw_3-series_actf34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>With an MSRP of $35,450, the 2017 BMW 320i xDrive is a tad over our limit, but many shoppers won't mind the slight premium, considering all the BMW has to offer. Heading the list is excellent handling, followed by the top-notch xDrive all-wheel-drive system. And although the entry-level model doesn't come as well-appointed as some of its stablemates, it still carries an impressive list of standard equipment. The 2017 BMW 320i xDrive is EPA-rated at 27 mpg combined (23 city/34 highway). Starting MSRP: $35,450.</p>\n\n<p>3. <a href=\"/buick/regal/2017/\">2017 Buick Regal</a> (midsize car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/buick/regal/2017/fe/2017_buick_regal_f34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>Slotted between entry-level and luxury midsize sedans, the 2017 Buick Regal comes surprisingly well-outfitted for its price point. Standard equipment includes such niceties as heated leather seats, dual-zone automatic climate control and Buick's IntelliLink infotainment system. Ticking the box for the AWD option will add the benefit of extra traction in slippery conditions. The EPA rates the 2017 Buick Regal at 22 mpg combined (19 city/27 highway). Starting MSRP: $31,465.</p>\n\n<p>4. <a href=\"/chrysler/200/2017/sedan/\">2017 Chrysler 200</a> (midsize car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/chrysler/200/2017/fe/2017_chrysler_200_actf34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>With up-to-date styling and a solid-performing V6 engine, the 2017 Chrysler 200 might just catch the attention of Mopar fans who need some extra road grip in their part of the country. It features a decent number of standard features, but a wide array of trim levels, packages and options allow buyers to make it their own. For a midsize sedan, the 200 does have rather limited interior room, but this is partially offset by clever storage solutions in the cabin and a generous amount of trunk space. The 2017 Chrysler 200 achieved an EPA rating of 22 mpg (18 city/28 highway). Starting MSRP: $29,905.</p>\n\n<p>5. <a href=\"/dodge/charger/2017/sedan/\">2017 Dodge Charger</a> (full-size car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/dodge/charger/2017/fe/2017_dodge_charger_actf34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>Best known as a stylish performance model, adding AWD to the 2017 Dodge Charger morphs it into a practical all-season hauler. True, it might not have the generous trunk space and rear-seat headroom of some rivals, but what it lacks in those areas it makes up with technology that includes the updated Uconnect infotainment system, a huge option list and the undeniable cool factor. The base six-cylinder 2017 Dodge Charger is EPA-rated at 21 mpg combined (18 city/27 highway). Starting MSRP: $30,245.</p>\n\n<p>6. <a href=\"/ford/fusion/2017/sedan/\">2017 Ford Fusion</a> (midsize car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/ford/fusion/2017/fe/2017_ford_fusion_actf34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>The 2017 Ford Fusion tempts shoppers with good fuel economy, a choice of peppy engines and an array of the latest tech features. Add in hip exterior styling, a well-designed cabin and a wealth of available trim levels and packages, and it's no wonder the Fusion is a popular choice with shoppers seeking midsize AWD transportation at a budget price. The EPA rates the 2017 Ford Fusion with the base four-cylinder engine at 23 mpg combined (20 city/29 highway). Starting MSRP: $27,405.</p>\n\n<p>7. <a href=\"/mercedes-benz/cla-class/2017/\">2017 Mercedes-Benz CLA-Class</a> (compact car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mercedes-benz/cla-class/2017/fe/2017_mercedes-benz_cla-class_f34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>The 2017 Mercedes-Benz CLA-Class provides entry into the German luxury brand at a relatively affordable price. With that distinctive Mercedes styling, a comfortable ride and a decent number of standard features, the CLA-Class has a lot to offer, although sluggish engine response could give pause to some buyers. Still, with the addition of 4Matic all-wheel drive, the CLA makes for practical, upscale winter transport. EPA-rated at 27 mpg combined (23 city/32 highway). Starting MSRP: $34,400.</p>\n\n<p>8. <a href=\"/mini/clubman/2017/hatchback/\">2017 Mini Clubman</a> (compact car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mini/clubman/2017/fe/2017_mini_clubman_f34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>With seating for five and a good amount of cargo space, the 2017 Mini Clubman isn't so mini, but it's still compact enough for easy maneuvering. And with the available All4 AWD system, the Clubman becomes capable all-season &mdash; if not exactly all-terrain &mdash; family transport. For buyers who want to recapture some Mini sportiness, All4 is standard on the performance-minded Cooper S and John Cooper Works models. The EPA rates the base AWD 2017 Mini Clubman at 26 mpg combined (22 city/32 highway). Choose the eight-speed automatic and you get 25 mpg combined (22 city/29 highway). Starting MSRP: $25,900.</p>\n\n<p>9. <a href=\"/mitsubishi/lancer/2017/sedan/\">2017 Mitsubishi Lancer</a> (compact car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mitsubishi/lancer/2017/fe/2017_mitsubishi_lancer_f34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>Already an able performer with a peppy 2.4-liter engine and secure, sporty handling, the 2017 Mitsubishi Lancer with AWD is also able to handle a variety of low-traction conditions. It's not a luxury vehicle by any means, but the Lancer's low base price will catch the attention of many shoppers. And that low entry fee allows buyers to add a host of options or step up a trim level. The 2017 Mitsubishi Lancer is EPA-rated at 26 mpg combined (23 city/30 highway). Starting MSRP: $20,295.</p>\n\n<p>10. <a href=\"/subaru/impreza/2017/sedan/\">2017 Subaru Impreza</a> (midsize car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/subaru/impreza/2017/fe/2017_subaru_impreza_actf34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>The all-new 2017 Subaru Impreza, available as a sedan or hatchback, features a roomy cabin with improved materials, a more powerful engine and, of course, Subaru's standard AWD. While it still doesn't deliver best-in-class acceleration, the Impreza's on-road behavior is exemplary, with confident handling, flat cornering and good steering feedback. In standard trim, the 2017 Subaru Impreza is rated by the EPA at 32 mpg combined (28 city/38 highway), although the Sport version is rated about 2 mpg less. Starting MSRP: $18,395.</p>\n\n<p>11. <a href=\"/subaru/legacy/2017/sedan/\">2017 Subaru Legacy</a> (midsize car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/subaru/legacy/2017/fe/2017_subaru_legacy_actf34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>The 2017 Subaru Legacy competes in the super-competitive midsize market segment, but its standard AWD, do-anything capability and good-size list of standard features make it worthy of serious consideration. Buyers looking for extra comfort, convenience and technology have a wide range of trim levels and options to choose from, which tack on such items as multizone climate control, leather upholstery and upgraded suspension. The 2017 Subaru Legacy with the standard four-cylinder engine achieved an EPA rating of 29 mpg combined (25 city/34 highway). Starting MSRP: $21,995.</p>\n\n<p>12. <a href=\"/subaru/wrx/2017/sedan/\">2017 Subaru WRX</a> (compact car)</p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/subaru/wrx/2017/fe/2017_subaru_wrx_f34_fe_125171_717.jpg\" width=\"690\" height=\"460\" alt=\"Best AWD Sedans under $35K\"></p>\n\n<p>With its rally heritage, turbocharged powerplant and sport-oriented suspension, the 2017 Subaru WRX is not exactly your run-of-the-mill grocery-getter. But enthusiasts looking for a relatively practical compact AWD sedan that also offers an entertaining driving experience will likely appreciate the WRX's unique mix of attributes. And for those seeking an extra boost of performance, there's the WRX STI model with an even more powerful engine and aggressive suspension. The EPA rates the standard 2017 Subaru WRX with manual gearbox at 23 mpg combined (20 city/27 highway). Starting MSRP: $26,695.</p>"
    },
    {
      "title": "2016 BMW 340i xDrive Long-Term Road Test",
      "tags": [
        "long term road tests",
        "BMW 3 Series",
        "road tests",
        "2016 BMW 3 Series",
        "editor reviews"
      ],
      "niceNamedTags": [
        "2016-bmw-3-series",
        "bmw-3-series",
        "long-term-road-tests",
        "road-tests",
        "editor-reviews"
      ],
      "description": "December 2016 Update",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-xdrive-monthly-update-for-december-2016.html"
      },
      "authors": [],
      "body": "\n\n<h3>2016 BMW 340i xDrive: Monthly Update for December 2016</h3>\n\n<p>by Mark Takahashi, Automotive Editor</p>\n\n\n\n\n\n<p><strong>Where Did We Drive It?</strong><br>\n  It's  been a weird month for me and our long-term <a href=\"/bmw/3-series/2016/sedan/\">2016 BMW 340i</a>.  The editors here at Edmunds generally sign out a different vehicle Monday  through Wednesday and stay in something from Thursday through Sunday. With the  holidays, however, we ended up keeping one vehicle for over two weeks straight.</p>\n<p>Since  I'm a Los Angeles native, there weren't any epic drives to Grandma's house,  just a bunch of short trips and errands in our 340i.  </p>\n\n\n\n<p><strong>What Kind of Fuel Economy Did It Get?</strong><br>\n  Unsurprisingly,  our 340i's lifetime average for fuel economy dropped while the car was in my  care. What can I say? I like performance. Still, it was only a 0.2-mpg drop,  and we're doing pretty well against the EPA estimates.</p>\n<p>Average lifetime mpg: 24.4 mpg<br>\n  EPA mpg rating: 25 mpg combined (22  city/32 highway)<br>\n  Best fill mpg: 34.6 mpg<br>\n  Best range: 518.4 miles<br>\n  Current odometer: 17,664 miles</p>\n<p><strong>Logbook Highlights</strong></p>\n<p><em><u>Performance</u></em><br>\n  &quot;The  difference between Comfort and Sport+ driving modes is sizable. It sounds  corny, but it's like you get a different car in those modes, and both are  excellent at what they're intended for. In Sport+ mode, you hear a subtle  crackle from the exhaust on throttle overrun. I approve!&quot; &mdash; <em>Mark Takahashi, Automotive Editor</em></p>\n<p>&quot;I'm  always astounded by the 340i's lovely powertrain. On paper, the specs aren't  exactly eye-popping (320 horsepower and 330 pound-feet of torque from a  turbo-six are just 10 hp and lb-ft more than the Ford Mustang's turbo-four  manages), but real-life performance is fantastic. At our test track, our BMW  pummeled an automatic-equipped Mustang by 1.5 seconds in a zero-to-60-mph  sprint. On the road, the 340i's accelerator pedal has a bit of resistance that  I appreciate. It sounds silly to say, but it makes you feel like unleashing the  engine's power is a deliberate decision that is not to be taken lightly.&quot;  &mdash; <em>Cameron Rogers, Associate  Editor</em></p>\n<p>&quot;It  finally rained in L.A.! I took the BMW out to a special area where I can test  out a car's handling on wet pavement and was both disappointed and impressed.  First, I was disappointed because I totally forgot our 340i is the xDrive  all-wheel-drive model and it just wouldn't get squirrelly enough for me.  Usually with a rear-wheel-drive BMW, I can have a bit of hooligan, tail-out  fun. Not so in our 340i. That said, it was impressively quite controllable,  even with the stability control system turned off.&quot; &mdash; <em>Mark Takahashi</em></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_bdg_lt_1031701_717.jpg\" alt=\"2016 BMW 340i xDrive\" /></p>\n\n<p><u>Comfort</u><br>\n  &quot;We've  written about BMW's front sport seats before, but it bears repeating: BMW makes  some of the best thrones in the game. They feature a multitude of adjustments,  including four-way lumbar and adjustable side bolsters. But the highlight for  me is the seat bottom, which offers a steep incline and extendable thigh  support, a boon to tall drivers like me. The headrest can also be angled  forward quite a bit, too. Best of all, these seats come standard on most 3  Series models except the 320i, where they are included in the Sport package.&quot;  &mdash; <em>Cameron Rogers</em></p>\n<p><em><u>Technology-Audio</u></em><br>\n  &quot;After  a few days with the 340i, I didn't have to look at buttons for the various  drive modes, iDrive (media, phone and navigation) and on the steering wheel.  That tells me they're thoughtfully and logically placed.&quot; &mdash; <em>Mark Takahashi</em></p>\n<p>&quot;Standard  on the 340i is a 16-speaker Harman Kardon audio system and it sounds great.  From Beethoven to Lil Jon, the speaker delivered precisely what you'd want, and  that's power and clarity. If you like strong audio, it may be worth upgrading  to this if you get a supporting 3 Series model.&quot; &mdash; <em>Mark Takahashi</em></p>\n<p>&quot;I  like the way the adaptive cruise control works in our long-termer, though I  agree with a previous post that it's <a href=\"/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-adaptive-cruise-control-is-just-ok.html\">not quite as good</a> as the Mercedes system.&quot; &mdash; <em>Mark Takahashi</em></p>\n"
    },
    {
      "title": "Most Researched Cars in 2016",
      "tags": [
        "Honda Odyssey",
        "Chevrolet Impala",
        "Jeep Grand Cherokee",
        "Honda CR-V",
        "Honda Fit",
        "Honda Civic",
        "Dodge Durango",
        "Toyota Tacoma",
        "Ford Mustang",
        "top 10 lists",
        "Tesla Model X",
        "Chevrolet Corvette",
        "Acura MDX",
        "Mercedes-Benz E-Class",
        "BMW 3 Series",
        "Honda Pilot",
        "Ford F-150",
        "Lexus RX 350",
        "BMW i8",
        "Mazda CX-9",
        "Tesla Model S",
        "Honda Accord",
        "Ford Transit"
      ],
      "niceNamedTags": [
        "toyota-tacoma",
        "acura-mdx",
        "honda-accord",
        "honda-cr-v",
        "mercedes-benz-e-class",
        "honda-civic",
        "dodge-durango",
        "bmw-3-series",
        "honda-pilot",
        "chevrolet-corvette",
        "honda-odyssey",
        "ford-transit",
        "bmw-i8",
        "lexus-rx-350",
        "top-10-lists",
        "chevrolet-impala",
        "ford-f-150",
        "ford-mustang",
        "tesla-model-s",
        "jeep-grand-cherokee",
        "mazda-cx-9",
        "tesla-model-x",
        "honda-fit"
      ],
      "description": "Which vehicles are people researching most often on Edmunds.com? What makes them contenders? Here are the results for 2016.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/car-reviews/top-10/most-researched-cars-in-2016.html"
      },
      "authors": [
        {
          "name": "Carroll Lachnit"
        }
      ],
      "body": "<div style=\"display: block; position: relative; width: 685px; max-width: 720%;\"><div style=\"padding-top: 56.25%;\"><iframe src=\"//players.brightcove.net/1898241405/HJZaJwKlx_default/index.html?videoId=5270925175001\"\nallowfullscreen \nwebkitallowfullscreen \nmozallowfullscreen \nstyle=\"width: 100%; height: 100%; position: absolute; top: 0px; bottom: 0px; right: 0px; left: 0px;\"></iframe></div></div>\n\n<p>Millions of shoppers visit Edmunds.com each month to find their perfect car. With so many vehicles to choose from, you might want to put some crowdsourcing to work for you. Which vehicles are people researching most often? What makes these cars contenders? </p>\n\n<p>Here are the answers for 2016: the cars, trucks and SUVs in each vehicle segment that attracted the most car-shopper consideration from January 1, 2016, through November 30, 2016. When a car is so popular, maybe it's one you'd want to consider, too. In 2016, shoppers looked at new cars over several model years and the top ones are listed alphabetically by their vehicle segments. We've summarized some of the reasons for their popularity with car shoppers and included helpful links for your own research. </p>\n\n<p>Compact Car: <a href=\"/honda/civic/\">Honda Civic</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/civic/2017/fe/2017_honda_civic_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>Since its launch in 1973, the Honda Civic has been one of the most popular compact cars sold in America. Its success can be attributed in large part to its consistently high level of quality inside and out and its long-standing reputation for reliability and low running costs. Impressive fuel economy and engaging performance have also played a role in making the Civic a top choice for car shoppers. </p>\n\n<p>Learn more about  the <a href=\"/honda/civic/2017/\">2017 Honda Civic</a></p>\n\n<p>Compact Crossover SUV: <a href=\"/honda/cr-v/\">Honda CR-V</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/cr-v/2017/fe/2017_honda_cr-v_f34_fe_1216161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>When the original Honda CR-V debuted in the late 1990s, its mission was simple: Offer a more compact and convenient alternative to the midsize and full-size SUVs that were popular at the time. With its car-based design, economical four-cylinder engine and sedanlike ride and handling, the CR-V was an instant hit. And that hasn't changed in the intervening years.<br>\n Learn more about the<a href=\"/honda/cr-v/2016/\"> 2016 Honda CR-V</a><u> </u></p>\n\n<p>Compact Truck: <a href=\"/toyota/tacoma/\">Toyota Tacoma</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/toyota/tacoma/2017/fe/2017_toyota_tacoma_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>Since its introduction in 1995, the Toyota Tacoma has been a mainstay of the compact and midsize pickup segments. Typical advantages to a new or used Tacoma include a variety of body styles, useful off-road abilities, strong resale value and a better-than-average reputation for reliability. </p>\n\n<p>Learn more about the <a href=\"/toyota/tacoma/2017/\">2017 Toyota Tacoma</a></p>\n\n<p>Entry Luxury Car: <a href=\"/bmw/3-series/\">BMW 3 Series</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2017/fe/2017_bmw_3-series_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The BMW 3 Series is one of the top-selling luxury cars in the United States and a favorite with shoppers for good reason. It's a classy entry-level luxury car endowed with world-class fit and finish, spirited performance and an exquisite ride-and-handling balance unmatched by most vehicles at any price. </p>\n\n<p>Learn more about the <a href=\"/bmw/3-series/2017/\">2017 BMW 3 Series</a></p>\n\n<p>Entry Luxury SUV: <a href=\"/lexus/rx-350/suv/\">Lexus RX 350</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/lexus/rx-350/2017/fe/2017_lexus_rx-350_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The Lexus RX 350 is a vehicle that's comfortable in its own metal. And why wouldn't it be? This midsize, entry-level luxury crossover SUV has long been a consumer favorite thanks to its plush ride, spacious interior, strong reliability record and appealing high-tech features. </p>\n\n<p>Learn more about the<a href=\"/lexus/rx-350/2017/suv/\"> 2017 Lexus RX 350</a></p>\n\n<p>Entry Sport Car: <a href=\"/ford/mustang/\">Ford Mustang</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/ford/mustang/2017/fe/2017_ford_mustang_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>About as popular a household automotive name as you'll find, the Ford Mustang is the longest-surviving example of the classic, affordable American muscle car. Oil crises, tightening emissions standards and corporate budget cuts have sometimes put its future in doubt. But the Mustang has endured and stands as one of Ford's greatest success stories. </p>\n\n<p>Learn more about the <a href=\"/ford/mustang/2017/\">2017 Ford Mustang</a></p>\n\n<p>Large Car: <a href=\"/chevrolet/impala/\">Chevrolet Impala</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/chevrolet/impala/2016/fe/2016_chevrolet_impala_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>When Chevrolet rolled the first Impala off the assembly line in 1958, it was meant to be \"a prestige car within the reach of the average American citizen.\" Decades later, the Chevrolet Impala is still one of America's best-known nameplates, and it's a fine option for shoppers seeking a large, comfy sedan that doesn't skimp on the latest technology. </p>\n\n<p>Learn more about the <a href=\"/chevrolet/impala/2017/\">2017 Chevrolet Impala</a></p>\n\n<p>Large Crossover SUV: <a href=\"/mazda/cx-9/\">Mazda CX-9</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mazda/cx-9/2016/fe/2016_mazda_cx-9_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The only vehicles capable of carrying seven adults or lots of cargo used to be minivans, traditional full-size SUVs and passenger vans. But large crossover SUVs such as the Mazda CX-9 have been a game-changer, providing the space of a large SUV, respectable fuel economy and handling, and exterior styling that doesn't immediately scream \"diapers!\" </p>\n\n<p>Learn more about the <a href=\"/mazda/cx-9/2016/\">2016 Mazda CX-9</a></p>\n\n<p>Large Traditional SUV: <a href=\"/dodge/durango/\">Dodge Durango</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/dodge/durango/2017/fe/2017_dodge_durango_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>Over the years, the Durango has been known for its confident handling and composed, comfortable ride. Inside, the Durango offers an attractive and upscale design, with class-competitive quality and features. The Durango offers three rows of seating, a range of V6 and V8 engines, and a choice of rear-wheel drive or four-wheel drive &mdash; just what you'd expect from a large traditional SUV. </p>\n\n<p>Learn more about the <a href=\"/dodge/durango/2017/\">2017 Dodge Durango</a></p>\n\n<p>Large Truck: <a href=\"/ford/f-150/\">Ford F-150</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/ford/f-150/2017/fe/2017_ford_f-150_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The Ford F-150 is the star of the long-running F-Series line, which stretches back to the post-World War II era. Originally conceived as a rugged, no-frills workhorse, the Ford F-150 has since morphed into a well-appointed, versatile rig with numerous trim levels that serve a wide range of shoppers, including weekend warriors who need room for the family and the occasional trip to the hardware store. </p>\n\n<p>Learn more about the <a href=\"/ford/f-150/2017/\">2017 Ford F-150</a></p>\n\n<p>Midrange Luxury Car: <a href=\"/mercedes-benz/e-class/\">Mercedes-Benz E-Class</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/mercedes-benz/e-class/2017/fe/2017_mercedes-benz_e-class_f34_fe_1215161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>A favorite in the midsize luxury car class, the Mercedes-Benz E-Class provides an appealing mix of comfort, performance and safety. The trademark qualities of Mercedes-Benz vehicles, such as vault-like solidity and cutting-edge technology, have also contributed to the E-Class' great popularity among luxury buyers. </p>\n\n<p>Learn more about the <a href=\"/mercedes-benz/e-class/2017/\">2017 Mercedes-Benz E-Class</a></p>\n\n<p>Midrange Luxury SUV: <a href=\"/acura/mdx/\">Acura MDX</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/acura/mdx/2017/fe/2017_acura_mdx_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The Acura MDX is a midsize luxury SUV with a carlike unibody platform and three rows of seats. The original MDX bowed in 2001, and since then Acura has maintained the MDX's family-friendly packaging, including standard seven-passenger seating, while spicing up the recipe with various styling, performance and handling enhancements. </p>\n\n<p>Learn more about the <a href=\"/acura/mdx/2017/\">2017 Acura MDX</a></p>\n\n<p>Midrange Sport Car: <a href=\"/chevrolet/corvette/\">Chevrolet Corvette</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/chevrolet/corvette/2016/fe/2016_chevrolet_corvette_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>Often referred to<strong> </strong>as America's only true sports car, the Chevrolet Corvette is one of the world's best-known and longest-running nameplates. From its rather humble six-cylinder beginnings in 1953 to the 638-horsepower ZR1, the Corvette has transformed a lot over time, but it has always maintained the key aspects of style and performance that make a Vette a Vette. </p>\n\n<p>Learn more about the <a href=\"/chevrolet/corvette/2017/\">2017 Chevrolet Corvette</a></p>\n\n<p>Midsize Car: <a href=\"/honda/accord/\">Honda Accord</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/accord/2017/fe/2017_honda_accord_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>Few vehicles from overseas manufacturers have garnered as much respect in North America as the Honda Accord. It hasn't achieved this status by being glamorous, sexy or thrilling. But if you take an Accord for a spin, you'll find it to be comfortable, roomy, intelligently engineered and easy to drive. It's also backed by strong resale value and a solid reputation for reliability. </p>\n\n<p>Learn more about the <a href=\"/honda/accord/2017/\">2017 Honda Accord</a></p>\n\n<p>Midsize Crossover SUV: <a href=\"/honda/pilot/\">Honda Pilot</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/pilot/2017/fe/2017_honda_pilot_f34_fe_1216161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>Since its launch for the 2003 model year, the Honda Pilot has helped shape the market for crossover SUVs with three rows of seating. Offering V6 power, respectable fuel economy, a comfortable ride, plenty of interior space and seven- or eight-passenger seating, the Pilot is exactly the kind of vehicle that appeals to growing families who shy away from traditional minivans. </p>\n\n<p>Learn more about the <a href=\"/honda/pilot/2017/\">2017 Honda Pilot</a></p>\n\n<p>Midsize Traditional SUV: <a href=\"/jeep/grand-cherokee/\">Jeep Grand Cherokee</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/jeep/grand-cherokee/2017/fe/2017_jeep_grand-cherokee_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The Jeep Grand Cherokee is one of the pioneers of the modern midsize SUV. Since its introduction in the early 1990s, the Grand Cherokee has been maneuverable enough for urban duty, roomy enough for families, stylish enough to take out on the town, and capable enough to tow your toys or shuttle your passengers to a remote campsite. Modern Grand Cherokees are far more refined than the early models, but they're no less versatile. </p>\n\n<p>Learn more about the <a href=\"/jeep/grand-cherokee/2017/\">2017 Jeep Grand Cherokee</a></p>\n\n<p>Minivan: <a href=\"/honda/odyssey/\">Honda Odyssey</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/odyssey/2017/fe/2017_honda_odyssey_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>For most of its lifespan, the Honda Odyssey has been a top pick among minivans. It really hit its stride when Honda redesigned it for 1999. That van featured a powerful engine, an exceptionally spacious cabin and an innovative third-row seat that folded into the floor. These attributes have carried through to every Honda Odyssey since. Honda will introduce a redesigned Odyssey in 2017. </p>\n\n<p>Learn more about the <a href=\"/honda/odyssey/2016/\">2016 Honda Odyssey</a></p>\n\n<p>Premium Luxury Car: <a href=\"/tesla/model-s/\">Tesla Model S</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/tesla/model-s/2016/lt/2016_tesla_model-s_actf34_lt_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The Tesla Model S luxury sport sedan breaks with electric-car styling by featuring a sleek exterior that houses a thoroughly modern and upscale cabin. It also has the potential for stunning performance in terms of both acceleration and handling. Yet, as with many EVs, the Model S provides near-silent propulsion, further enhancing its luxurious silence on the road.<br>\n Learn more about the<a href=\"/tesla/model-s/2016/\"> 2016 Tesla Model S</a><u> </u></p>\n\n<p>Premium Luxury SUV: <a href=\"/tesla/model-x/2016/suv/review/\">Tesla Model X</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/tesla/model-x/2016/lt/2016_tesla_model-x_f34_lt_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>If you want a family-friendly luxury electric SUV, the Tesla Model X is in a class of one. You'll love the large door openings and silent speed of this midsize electric crossover, which utilizes many of the same components as Tesla's successful Model S sedan. </p>\n\n<p>Learn more about the <a href=\"/tesla/model-x/2016/suv/\">2016 Tesla Model X</a></p>\n\n<p>Premium Sport Car: <a href=\"/bmw/i8/\">BMW i8</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/i8/2017/fe/2017_bmw_i8_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>The BMW i8 is a genre-buster: a six-figure, futuristic-looking plug-in hybrid sports car. It offers impressive acceleration &mdash; the sprint to 60 mph takes just 4.5 seconds &mdash; and flamboyant styling. The i8's dramatic sweeping lines and scissor-lift doors make it a safe bet you'll stand out in any crowd. Even if you're standing still. </p>\n\n<p>Learn more about the <a href=\"/bmw/i8/2017/\">2017 BMW i8</a></p>\n\n<p>Subcompact Car: <a href=\"/honda/fit/\">Honda Fit</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/honda/fit/2017/fe/2017_honda_fit_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>A subcompact four-door hatchback, the Honda Fit has earned praise for its engineering and design, and it has found its niche with consumers drawn to its space-efficient design and easily reconfigurable rear seats. In the Honda Fit, you'll find crisp handling, solid build quality and impressive cargo capacity. </p>\n\n<p>Learn more about the <a href=\"/honda/fit/2017/\">2017 Honda Fit</a><u> </u></p>\n\n<p>Van: <a href=\"/ford/transit-van/\">Ford Transit</a><u> </u></p>\n\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/ford/transit/2017/fe/2017_ford_transit_f34_fe_1220161_717.jpg\" width=\"690\" height=\"460\" alt=\"Most Researched Cars in 2016\"></p>\n\n<p>If you need proof that full-size vans are a lot more sophisticated than they used to be, look no further than the Ford Transit. With a wide variety of configurations, a choice of powerful and fuel-efficient engines and easygoing driving manners, this feature-rich van should meet all of your commercial business needs. </p>\n\n<p>Learn more about the <a href=\"/ford/transit-van/2017/\">2017 Ford Transit</a></p>"
    },
    {
      "title": "2016 BMW 340i xDrive Long-Term Road Test",
      "tags": [
        "long term road tests",
        "BMW 3 Series",
        "road tests",
        "2016 BMW 3 Series",
        "editor reviews"
      ],
      "niceNamedTags": [
        "2016-bmw-3-series",
        "bmw-3-series",
        "long-term-road-tests",
        "road-tests",
        "editor-reviews"
      ],
      "description": "We've got the latest report on Edmunds' 2016 BMW 340i long-term test car. Read on for updates on performance, maintenance, mpg and more.",
      "link": {
        "rel": "related",
        "href": "http://www.edmunds.com/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-monthly-update-for-november-2016.html"
      },
      "authors": [],
      "body": "\n<h3>2016 BMW 340i: Monthly Update for November 2016</h3>\n\n<p>by Brent Romans, Senior Automotive Editor</p>\n\n\n<p><strong>Where Did We Drive It?</strong><br>\n  We drove  our <a href=\"/bmw/3-series/2016/\">2016 BMW 340i</a> about 1,500 miles during the month  of November. It was an an uneventful month, truth be told. But it rained here  in Southern California (something of an event!) and that gave us a chance to  test out our car's traction-enhancing all-wheel drive. We also visited a BMW  dealership for some warranty work and impressed visiting family members during  Thanksgiving. All and all, it was a solid month for our 340i.</p>\n\n<p><strong>What Kind of Fuel Economy Did It Get?</strong><br>\n  For the  month, we averaged 25.3 mpg. That's right at what the EPA says to expect for a  2016 340i with all-wheel drive. You might even consider this to be better than  expected given how compelling it is to give the 340i the spurs and take  advantage of the turbocharged engine's 320 well-bred ponies. The same could be  said for our lifetime average, which is holding steady at close to 25 mpg.</p>\n<p>Average lifetime mpg: 24.6 mpg<br>\n  EPA mpg rating: 25 mpg combined (22  city/32 highway)<br>\n  Best fill mpg: 34.6 mpg<br>\n  Best range: 518.4 miles<br>\n  Current odometer: 16,408 miles</p>\n<p><strong>Maintenance and Upkeep </strong><br>\n  When I  brought our 340i in for a oil change service <a href=\"/bmw/3-series/2016/long-term-road-test/2016-bmw-340i-first-service-performed-but-well-have-to-go-back.html\">back in August</a>, the dealership wasn't able reset  the car's oil change indicator. A diagnosis eventually led to the discovery  that our car's oil level sensor was defective. At the time, though, the  dealership didn't have the part (it had to be special-ordered from Germany). I  decided to just wait until a more convenient time to get our car fixed.</p>\n<p>This  month, at the 16,109-mile mark, I took the 340i to my local BMW dealer (<a href=\"//www.bmwfresno.com/\" target=\"_blank\">BMW Fresno</a>)  to have the sensor ordered and installed. It took about half a day and was  covered under warranty. From the service invoice: &quot;<em>As per previous diagnosis, found faulty oil level switch. Drained oil  into clean container. Removed and replaced oil level sensor and reinstalled oil  and reset lights.</em>&quot;</p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_r34_lt_112816_717.jpg\" alt=\"2016 BMW 340i\" /></p>\n<p><strong>Logbook Highlights</strong></p>\n<p><u>Performance</u><br>\n  <strong>&quot;</strong>Our  2017 BMW 340i's handling capability does little to impress. This isn't a luxury  sport sedan that inspires me to seek out curvy roads or take the long way home,  nor is it a willing or energizing sedan the way I'd hope a 3 Series would be.  Much of the blame could go to the lifeless steering. It provides little  feedback or a sense of control. On occasions when I've thrown our 340i into a  turn, it feels heavy, too. The good news is that our 340i is a secure and  stable sedan. But it's just not much fun when the road bends.&quot; &mdash; <em>Brent Romans, Senior Automotive Editor</em></p>\n<p>&quot;We've  got an all-wheel-drive 340i, as indicated by its xDrive name. It's pretty much  unnecessary considering it's sunny and warm about 95 percent of the time in  Southern California (which is where Edmunds is based). But it did rain today,  and that gave me a chance to see what happens when you give the gas pedal a  solid whack. Answer: It's the same outlandish acceleration as when the pavement  is dry. No wheelspin or drama, just warp speed. Whee! Our 340i is an all-season  sport sedan.&quot; &mdash; <em>Brent  Romans</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_f34_lt_111516_717.jpg\" alt=\"2016 BMW 340i\" /></p>\n<p><u>Maintenance</u><br>\n  &quot;I  hopped into our 340i this morning and noticed that the tire pressure warning  light was on. It's getting cold here in California (cold for us thin-skinned  Californians, anyway), and experience has shown that low pressure indicators  often pop up because of the lower temperatures. But you never really know,  right? It could also be an actual tire puncture. Thankfully, our 340i provides  very useful tire pressure information. It shows up on two displays: a basic one  in the gauge cluster and a more detailed one on the central display screen. By  monitoring the tire pressures, I confirmed they weren't dropping further, so it  was indeed just the cold temps that had set it off. I inflated our tires up a  bit to compensate for the colder temps, and all is well again.&quot;  &mdash; <em>Brent Romans</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_det_lt_111816_717.jpg\" alt=\"2016 BMW 340i\" /></p>\n<p><u>Cargo  Space</u><br>\n  &quot;Although  the 3 Series may have grown over the years, it's still not quite the  full-fledged executive sedan you might think it is. Take the trunk for  instance. You can barely fit one standard size golf bag in it. If fact, I had  to take my driver out just to get it in there without bending anything. Of course,  if you really had to fit another bag in there, you could always fold the  backseats down. Three bags isn't going to happen without a little creative  packing.&quot; &mdash; <em>Ed Hellwig,  Executive Editor</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_crg_lt_111316_717.jpg\" alt=\"2016 BMW 340i\" /></p>\n<p><u>Technology-Audio</u><br>\n  &quot;Is  this BMW's idea of helpful traffic information? There's way too much data  crammed onto the navigation screen. You can't see the difference between the  highway traffic and the surface streets. It's a mess and far from helpful. It  should default to highway traffic only and make the streets a different color.  Otherwise it's just a maze of colorful lines that mean nothing.&quot;  &mdash; <em>Ed Hellwig</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_nav_lt_110816_717.jpg\" alt=\"2016 BMW 340i\" /></p>\n<p>&quot;Compared  to many touchscreen infotainment interfaces, BMW's iDrive is harder to learn.  There's more of a learning curve required to know how to make it work and find  what you want. But the good news is that once you learn it, it's a superior  interface. Using the knob-based controller (and the surrounding physical  buttons) requires less of your attention than pushing virtual buttons on a  touchscreen, and that translates to less driver distraction. iDrive's menu  structure is logical, too. Of the main infotainment interfaces out there,  iDrive continues to be my favorite.&quot; &mdash; <em>Brent Romans</em></p>\n<p><u>Miscellaneous</u><br>\n  &quot;It  was fun having the keys to our 340i during the Thanksgiving holiday. I shuttled  a few visiting family members around, and they all came away impressed. I even  got to point out and employ the heated rear seats for my mother-in-law, and for  that I'm sure I scored a point or two. At one point, though, my father-in-law  asked how much our 340i cost. I pretty much blew his noodle when I told him  that our car ran about $60,000. 'Geez, that much? I'll stick with my Chevy  Malibu, thanks,' was his retort.&quot; &mdash; <em>Brent Romans</em></p>\n<p><img data-dsrc=\"//services.edmunds-media.com/image-service/media-ed/ximm/?quality=75&image=/bmw/3-series/2016/lt/2016_bmw_3-series_r34_lt_112616_717.jpg\" alt=\"2016 BMW 340i\" /></p>"
    }
  ],
  "articlesCount": 310,
  "links": [
    {
      "rel": "first",
      "href": "/api/editorial/v2/articles?model=3-series&fmt=json&api_key=sej676rt53rh2cwp9jrcr9h3&view=basic&make=bmw&pagesize=10&pagenum=1"
    },
    {
      "rel": "next",
      "href": "/api/editorial/v2/articles?model=3-series&fmt=json&api_key=sej676rt53rh2cwp9jrcr9h3&view=basic&make=bmw&pagesize=10&pagenum=2"
    },
    {
      "rel": "last",
      "href": "/api/editorial/v2/articles?model=3-series&fmt=json&api_key=sej676rt53rh2cwp9jrcr9h3&view=basic&make=bmw&pagesize=10&pagenum=31"
    }
  ]
}
